{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ef10c259-1e2d-4cac-bb98-493092bb4cb1",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import tqdm\n",
    "os.chdir(r\"C:\\Users\\smrit\\Work\\Kenpath\\zavmo-api\\zavmo\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "5c88c3d0-4d09-4074-a4f8-03ab51de1e21",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "pd.set_option('display.max_columns',500)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "ecd1aa5f-7732-4643-9b8f-1beb335b8873",
   "metadata": {},
   "outputs": [],
   "source": [
    "from helpers.chat import get_batch_openai_embedding"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e2f8d161-a81a-44c3-8ce7-9dad987e03dc",
   "metadata": {},
   "source": [
    "### Nos Prep"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "ba09ad4b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(14157, 8)\n"
     ]
    }
   ],
   "source": [
    "nos_df = pd.read_csv(\"../docs/rgcn/nos.csv\")\n",
    "print(nos_df.shape)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7d4573b9",
   "metadata": {},
   "source": [
    "### Nos Embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "a3e176ed-871d-42d5-b69b-2d2e7841e6ae",
   "metadata": {},
   "outputs": [],
   "source": [
    "nos_texts = [f\"{row['title']} {row['overview']} {row['performance_criteria']} {row['knowledge_understanding']} {row['keywords']} {row['relevant_roles']}\" for idx, row in nos_df.iterrows()]\n",
    "\n",
    "embeddings_nos = get_batch_openai_embedding(nos_texts)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e547baa6-2080-4a37-a7f5-31d7265f693f",
   "metadata": {},
   "source": [
    "### Ofqual Prep"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0cf968f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Ofqual Units: 17690\n",
      "Ofqual IDs: 3151\n"
     ]
    }
   ],
   "source": [
    "ofqual_df = pd.read_csv(r\"C:\\Users\\smrit\\Work\\Kenpath\\zavmo-api\\agents-markscheme\\ofqual_markscheme.csv\")\n",
    "print(f\"Ofqual Units: {ofqual_df.unit_id.nunique()}\")\n",
    "print(f\"Ofqual IDs: {ofqual_df.ofqual_id.nunique()}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "e25d85cf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "17690"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(ofqual_df['unit_id'].unique())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "211997e6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(24034, 17)"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ofqual_df.shape"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ec5b433",
   "metadata": {},
   "source": [
    "### Ofqual Embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6f63bcfa-cfa7-4ab2-96c0-0b034c489870",
   "metadata": {},
   "outputs": [],
   "source": [
    "ofqual_texts = [f\"{row['sector_subject_area']} {row['overview']} {row['unit_title']} {row['unit_description']} {row['unit_learning_outcomes']} {row['qualification_level']} \" for idx, row in ofqual_df.iterrows()]\n",
    "\n",
    "embeddings_ofqual = get_batch_openai_embedding(ofqual_texts)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "17d01b7d",
   "metadata": {},
   "source": [
    "### Connect to gdb"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "13f5d8b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Configure neomodel\n",
    "from neomodel import config, db\n",
    "DATABASE_URL = f'bolt://{os.getenv(\"NEO4J_USERNAME\")}:{os.getenv(\"NEO4J_PASSWORD\")}@{os.getenv(\"NEO4J_URI\")}'\n",
    "# DATABASE_URL = \"bolt://neo4j:secretgraph@localhost:7687\"\n",
    "config.DATABASE_URL = DATABASE_URL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "d620f309",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'bolt://neo4j:zavmoadmin@51.20.45.38'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "DATABASE_URL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b2ee5a28",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n"
     ]
    }
   ],
   "source": [
    "from neomodel import db\n",
    "print(db.url) "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "33040cb1",
   "metadata": {},
   "source": [
    "### Delete all the nodes present"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ce6d3c12",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Clear all nodes and relationships\n",
    "db.cypher_query(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "print(\"All nodes and relationships have been deleted from the database.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f6eba46d",
   "metadata": {},
   "source": [
    "### Delete Ofqual nodes present"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a19ffcbe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "deleted ofqual nodes from the database.\n"
     ]
    }
   ],
   "source": [
    "db.cypher_query(\"MATCH (n:OFQUALUnit) DETACH DELETE n\")\n",
    "\n",
    "print(\"deleted ofqual nodes from the database.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b6cbf75b-e7d5-4f0a-9785-7a152b044419",
   "metadata": {},
   "source": [
    "### Get top-10 Ofqual Units with Cosine Sim >= t"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c1494349-d182-42a7-a6fd-343ebcb68c20",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "from sklearn.metrics.pairwise import cosine_similarity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "e7076199-c38d-4bfb-9fc9-b33f32947f91",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import (\n",
    "    StructuredNode, \n",
    "    StringProperty, \n",
    "    FloatProperty,\n",
    "    RelationshipTo,\n",
    "    RelationshipFrom,\n",
    "    ArrayProperty,\n",
    "    JSONProperty\n",
    ")\n",
    "\n",
    "class NOSNode(StructuredNode):\n",
    "    nos_id   = StringProperty(unique_index=True, required=True)    \n",
    "    industry = StringProperty()\n",
    "    title = StringProperty()\n",
    "    overview = StringProperty()\n",
    "    performance_criteria = StringProperty()\n",
    "    knowledge_understanding = StringProperty()\n",
    "    keywords = StringProperty()\n",
    "    relevant_roles = StringProperty()\n",
    "    embedding = ArrayProperty(FloatProperty(), required=True)  # Add embedding vector\n",
    "    \n",
    "    ofqual_units = RelationshipTo('OFQUALUnit', 'MAPS_TO')\n",
    "\n",
    "class OFQUALUnit(StructuredNode):\n",
    "    ofqual_id = StringProperty(index=True)\n",
    "    unit_id = StringProperty(unique_index=True, required=True)\n",
    "    \n",
    "    overview = StringProperty()\n",
    "    unit_title = StringProperty()\n",
    "    unit_description = StringProperty()\n",
    "    unit_learning_outcomes = StringProperty()\n",
    "    qualification_type = StringProperty()\n",
    "    qualification_level = StringProperty()\n",
    "    assessment_methods = StringProperty()\n",
    "    sector_subject_area = StringProperty()\n",
    "    awarding_organisation = StringProperty()\n",
    "    total_credits = FloatProperty()\n",
    "    guided_learning_hours = FloatProperty()\n",
    "    total_qualification_time = FloatProperty()\n",
    "    awarding_organization = StringProperty()\n",
    "    markscheme = JSONProperty()\n",
    "    unit_uid = StringProperty()\n",
    "    \n",
    "    embedding = ArrayProperty(FloatProperty(), required=True)  # Add embedding vector\n",
    "    \n",
    "    nos_items = RelationshipFrom('NOSNode', 'MAPS_TO')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "32d1bca0-8640-4101-840b-af286fa87d73",
   "metadata": {},
   "source": [
    "# Create NOS nodes with embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "e095bc43-11fa-492f-bee6-6dae60f89b7d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Prepare the data for batch creation\n",
    "nos_data = []\n",
    "for idx, row in nos_df.iterrows():\n",
    "    nos_data.append({\n",
    "        'nos_id': row['nos_id'],\n",
    "        'industry': row['industry'],\n",
    "        'title': row['title'],\n",
    "        'overview': row['overview'],\n",
    "        'performance_criteria': row['performance_criteria'],\n",
    "        'knowledge_understanding': row['knowledge_understanding'],\n",
    "        'keywords': row['keywords'],\n",
    "        'relevant_roles': row['relevant_roles'],\n",
    "        'embedding': embeddings_nos[idx]\n",
    "        })\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "c439e188",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 5/5 [14:41<00:00, 176.27s/it]\n"
     ]
    }
   ],
   "source": [
    "BATCH_SIZE = 3000\n",
    "\n",
    "# Process NOS nodes in batches\n",
    "for i in tqdm.tqdm(range(0, len(nos_data), BATCH_SIZE)):\n",
    "    batch = nos_data[i:i + BATCH_SIZE]\n",
    "    with db.transaction:\n",
    "        batch_nodes = NOSNode.create_or_update(*batch)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13340573-dbc3-4a03-87eb-f74c09534eef",
   "metadata": {},
   "source": [
    "# Create OFQUAL nodes with embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "21a7e214-b649-4137-b8f2-0d88a34f29c4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Similarly for OFQUAL nodes\n",
    "ofqual_data = []\n",
    "for idx, row in ofqual_df.iterrows():\n",
    "    ofqual_data.append({\n",
    "        'ofqual_id': row['ofqual_id'],\n",
    "        'unit_id': row['unit_id'],\n",
    "        'overview': row['overview'],\n",
    "        'unit_title': row['unit_title'],\n",
    "        'unit_description': row['unit_description'],\n",
    "        'unit_learning_outcomes': row['unit_learning_outcomes'],\n",
    "        'qualification_type': row['qualification_type'],\n",
    "        'qualification_level': row['qualification_level'],\n",
    "        'assessment_methods': row['assessment_methods'],\n",
    "        'sector_subject_area': row['sector_subject_area'],\n",
    "        'awarding_organisation': row['awarding_organisation'],\n",
    "        'total_credits': row['total_credits'],\n",
    "        'guided_learning_hours': row['guided_learning_hours'],\n",
    "        'total_qualification_time': row['total_qualification_time'],\n",
    "        'awarding_organization': row['awarding_organization'],\n",
    "        'markscheme': row['markscheme'],\n",
    "        'unit_uid': row['unit_uid'],\n",
    "        'embedding': embeddings_ofqual[idx]\n",
    "    })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "40dd8d0c",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      " 44%|████▍     | 4/9 [1:28:10<2:16:19, 1635.95s/it]"
     ]
    }
   ],
   "source": [
    "\n",
    "BATCH_SIZE = 3000\n",
    "\n",
    "# Process OFQUAL nodes in batches\n",
    "for i in tqdm.tqdm(range(0, len(ofqual_data), BATCH_SIZE)):\n",
    "    batch = ofqual_data[i:i + BATCH_SIZE]\n",
    "    with db.transaction:\n",
    "        batch_nodes = OFQUALUnit.create_or_update(*batch)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8762a892",
   "metadata": {},
   "source": [
    "## Connecting NOS to OFQUAL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "5ef17c4e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Calculating similarities and creating relationships...\n"
     ]
    }
   ],
   "source": [
    "# Convert all embeddings to numpy arrays at once\n",
    "nos_embeddings_array = np.vstack(embeddings_nos)\n",
    "ofqual_embeddings_array = np.vstack(embeddings_ofqual)\n",
    "\n",
    "# Calculate all cosine similarities at once\n",
    "print(\"Calculating similarities and creating relationships...\")\n",
    "all_similarities = cosine_similarity(nos_embeddings_array, ofqual_embeddings_array)\n",
    "\n",
    "# Track relationship counts\n",
    "relationship_count = 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "553740c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "threshold = 0.0\n",
    "top_k = 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "e8f788cb-c032-4035-890e-bbb007af2e8d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created 1000 relationships so far...\n",
      "Created 2000 relationships so far...\n",
      "Created 3000 relationships so far...\n",
      "Created 4000 relationships so far...\n",
      "Created 5000 relationships so far...\n"
     ]
    }
   ],
   "source": [
    "# Process similarities for each NOS document and create relationships directly\n",
    "for nos_idx, similarities in enumerate(all_similarities):\n",
    "    # Get indices where similarity is above threshold\n",
    "\n",
    "    above_threshold_indices = np.where(similarities >= threshold)[0] \n",
    "\n",
    "    \n",
    "    if len(above_threshold_indices) > 0:\n",
    "        # Get the similarity scores for these indices\n",
    "        scores = similarities[above_threshold_indices]\n",
    "        \n",
    "        # If we have more matches than top_k, find the indices of top_k highest scores\n",
    "        if len(above_threshold_indices) > top_k:\n",
    "            # Get indices of top_k highest scores\n",
    "            top_indices = np.argsort(scores)[-top_k:]\n",
    "            # Get the corresponding ofqual indices and scores\n",
    "            selected_ofqual_indices = above_threshold_indices[top_indices]\n",
    "        else:\n",
    "            # Use all matches\n",
    "            selected_ofqual_indices = above_threshold_indices\n",
    "        \n",
    "        # Get the NOS node\n",
    "        nos_row  = nos_df.iloc[nos_idx]\n",
    "\n",
    "        nos_node = NOSNode.nodes.get(nos_id=nos_row['nos_id'])\n",
    "        # Check if the NOS node already has connections to OFQUAL units\n",
    "        existing_connections = len(list(nos_node.ofqual_units))\n",
    "\n",
    "        # if existing_connections > 0:\n",
    "        #     print(f\"Existing connections: {existing_connections}\")\n",
    "        #     continue\n",
    "        # else:\n",
    "        #     print(f\"Creating new connections for NOS {nos_row['nos_id']}...\")\n",
    "\n",
    "        # Create relationships directly\n",
    "        for ofqual_idx in selected_ofqual_indices:\n",
    "            ofqual_row = ofqual_df.iloc[ofqual_idx]\n",
    "            ofqual_node = OFQUALUnit.nodes.get(unit_uid=ofqual_row['unit_uid'])\n",
    "            \n",
    "            # Connect the nodes\n",
    "            nos_node.ofqual_units.connect(ofqual_node)\n",
    "            relationship_count += 1\n",
    "            \n",
    "            # Print progress every 1000 relationships\n",
    "            if relationship_count % 1000 == 0:\n",
    "                print(f\"Created {relationship_count} relationships so far...\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "333797d4",
   "metadata": {},
   "source": [
    "#### Number of documents ingested in nos_vector_index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "5e5e80e8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[14157]], ['indexed_documents'])"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\"MATCH (n:NOSNode) WHERE n.embedding IS NOT NULL RETURN COUNT(n) AS indexed_documents;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "76f356b4",
   "metadata": {},
   "source": [
    "## Retrieval"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "0075c300",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import List\n",
    "from openai import OpenAI\n",
    "\n",
    "\n",
    "def get_embedding(text: str, model: str = \"text-embedding-3-small\") -> List[float]:\n",
    "    \"\"\"\n",
    "    Get the embedding of a text using OpenAI's API.\n",
    "    \"\"\"\n",
    "    client = OpenAI(api_key=os.environ['OPENAI_API_KEY'])\n",
    "    response = client.embeddings.create(\n",
    "        input=text,\n",
    "        model=model\n",
    "    )\n",
    "    embedding = response.data[0].embedding\n",
    "    return embedding\n",
    "\n",
    "def retrieve_ofquals_from_neo4j(nos_id: str) -> List[str]:\n",
    "    \"\"\"Get the ofquals mapped to a nos_id\"\"\"\n",
    "    query = \"\"\"\n",
    "    MATCH (n:NOSNode {nos_id: $nos_id})-[:MAPS_TO]->(o:OFQUALUnit)\n",
    "    RETURN o.unit_id AS unit_id, o.unit_title AS unit_title, \n",
    "    o.overview AS overview, \n",
    "    o.level AS level, \n",
    "    o.qualification_type AS qualification_type, \n",
    "    o.qualification_level AS qualification_level, \n",
    "    o.awarding_organisation AS awarding_organisation, \n",
    "    o.total_credits AS total_credits, \n",
    "    o.guided_learning_hours AS guided_learning_hours, \n",
    "    o.total_qualification_time AS total_qualification_time, \n",
    "    o.unit_learning_outcomes AS learning_outcomes, \n",
    "    o.assessment_methods AS assessment_methods,\n",
    "    o.marksscheme AS marksscheme\n",
    "    \"\"\"\n",
    "    \n",
    "    # Execute the query\n",
    "    results, _ = db.cypher_query(query, {'nos_id': nos_id})\n",
    "    \n",
    "    connected_ofqual_units = [{'unit_id': row[0], 'unit_title': row[1], 'overview': row[2], 'level': row[3], \n",
    "                        'qualification_type': row[4], 'qualification_level': row[5], 'awarding_organisation': row[6], \n",
    "                        'total_credits': row[7], 'guided_learning_hours': row[8], 'total_qualification_time': row[9], \n",
    "                        'learning_outcomes': row[10], 'assessment_methods': row[11], 'marksscheme': row[12]} for row in results]\n",
    "    \n",
    "    return connected_ofqual_units\n",
    "\n",
    "def retrieve_nos_from_neo4j(query,index_name='nos_vector_index', top_k=5):\n",
    "    \"\"\"Retrieve NOS from Neo4j\"\"\"\n",
    "    query_embedding = get_embedding(query)\n",
    "    cypher_query = f\"\"\"\n",
    "        CALL db.index.vector.queryNodes('{index_name}', $top_k, $query_embedding) \n",
    "            YIELD node, score\n",
    "            RETURN \n",
    "                node.nos_id AS nos_id, \n",
    "                node.title AS title, \n",
    "                node.performance_criteria AS performance_criteria,\n",
    "                node.knowledge_understanding AS knowledge_understanding,\n",
    "                score\n",
    "            ORDER BY score DESC\n",
    "        \"\"\"\n",
    "\n",
    "    result, columns = db.cypher_query(cypher_query, {\"query_embedding\": query_embedding, \"top_k\": top_k})\n",
    "        \n",
    "    formatted_results = [dict(zip(columns, row)) for row in result]\n",
    "        \n",
    "    return formatted_results[:top_k]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "5168b174",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_text = \"\"\"The Ethics & Compliance function provides assurance that Centrica operates in a manner consistent with its legal and regulatory obligations. \n",
    "The Energy Compliance team is responsible for establishing and maintaining a robust compliance framework for energy and ensuring the governance structure within which the framework sits is effective.\"\"\"\n",
    "\n",
    "query_text = \"Ethics & Compliance professional in the energy sector, with a focus on establishing and maintaining compliance frameworks, regulatory compliance, and governance structures.\"\n",
    "\n",
    "# query_embedding = get_batch_openai_embedding([query_text])[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "8ce2047a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# results = retrieve_nos_from_neo4j(query_text, index_name='nos_vector_index', top_k=10)\n",
    "results = [{\"nos_id\": \"COGPACK46\", \"title\": \"Manage a project\", \"performance_criteria\": \"- Agree on key objectives and project scope with sponsors and stakeholders.\\n- Align the project with organizational vision and objectives.\\n- Develop a realistic project plan in consultation with relevant parties.\\n- Discuss and finalize the project plan with necessary stakeholders.\\n- Brief team members on their roles and provide support.\\n- Implement risk management and contingency processes.\\n- Use project management tools to monitor and control the project.\\n- Regularly communicate progress to all stakeholders.\\n- Make necessary adjustments to the project plan as issues arise.\\n- Confirm project completion with sponsors and stakeholders.\\n- Evaluate project success and learn from the experience.\", \"knowledge_understanding\": \"- Characteristics distinguishing projects from routine activities.\\n- Role and responsibilities of a project manager.\\n- Key stages in the project lifecycle.\\n- Importance of sponsor and stakeholder relationships.\\n- Information needed for effective planning.\\n- The significance of aligning projects with organizational objectives.\\n- Effective consultation methods for project planning.\\n- Elements included in a project plan.\\n- Providing team member support and communication methods.\\n- Risk management and contingency planning techniques.\\n- Project management tools for progress monitoring.\\n- Evaluating project success and recognizing team contributions.\\n- Sector-specific risks and regulations.\", \"score\": 0.7630696296691895}, {\"nos_id\": \"SCDLMCSE11\", \"title\": \"Manage a Project\", \"performance_criteria\": \"- Discuss and agree on key objectives and scope with sponsors and stakeholders.\\n- Identify alignment with organizational goals and other projects.\\n- Develop a comprehensive project plan in consultation with relevant parties.\\n- Brief project team members on their roles and provide ongoing support.\\n- Implement risk management processes and contingency plans.\\n- Apply project management tools to monitor and evaluate progress.\\n- Communicate updates to sponsors and stakeholders regularly.\\n- Confirm project completion and evaluate success, recognizing contributions from team members.\", \"knowledge_understanding\": \"- Knowledge of legislation, guidelines, and regulations specific to the care sector.\\n- Understanding of project management tools and techniques.\\n- Awareness of common risks and how to manage them.\\n- Familiarity with project lifecycle stages and the roles of project managers and sponsors.\\n- Skills in effective communication, evaluating project success, and recognizing team contributions.\", \"score\": 0.7595548629760742}, {\"nos_id\": \"SFTDW13\", \"title\": \"Manage a project\", \"performance_criteria\": \"- Discuss and agree on project objectives and scope with sponsors and stakeholders.  \\n- Identify project alignment with organizational goals.  \\n- Develop a realistic project plan in consultation with relevant parties.  \\n- Brief team members on their roles and provide ongoing support.  \\n- Manage potential risks and implement contingency plans.  \\n- Monitor and review project progress using project management tools.  \\n- Communicate progress regularly to sponsors and stakeholders.  \\n- Confirm project completion and evaluate success with stakeholder feedback.  \\n- Identify lessons learned from the project.\", \"knowledge_understanding\": \"- Fundamental characteristics of projects vs routine activities.  \\n- Role and responsibilities of a project manager.  \\n- Key stages in the project lifecycle.  \\n- Importance of stakeholder relationships.  \\n- Information needed for effective project planning.  \\n- Techniques for risk management and contingency planning.  \\n- Communication strategies with key stakeholders.  \\n- Methods for evaluating project success and recognizing team contributions.  \\n- Industry-specific tools, risks, and regulations.\", \"score\": 0.7538862228393555}, {\"nos_id\": \"ECIPMA5\", \"title\": \"Manage the project management team\", \"performance_criteria\": \"- Ensure allocation and authorization of work aligns with project objectives  \\n- Brief team members on project details and work allocations  \\n- Communicate changes in work allocations appropriately  \\n- Provide support and guidance to team members  \\n- Monitor and assess team performance against objectives  \\n- Offer timely feedback to enhance team performance  \\n- Manage conflicts between team members effectively  \\n- Regularly update objectives and work plans based on changes\", \"knowledge_understanding\": \"- Legislative, regulatory, and organizational requirements  \\n- Context and arrangements for project delivery  \\n- Management plans relevant to the project team  \\n- Methods for progress monitoring and evaluation  \\n- Strategies for work allocation and authorization  \\n- Clear communication of responsibilities  \\n- Conflict management techniques  \\n- Negotiation and influencing skills  \\n- Implications of managerial responsibilities on team dynamics\", \"score\": 0.7527942657470703}, {\"nos_id\": \"CCSAPLE30\", \"title\": \"Support the development, delivery and evaluation of community arts projects\", \"performance_criteria\": \"- Agree on personal role in project teams with relevant stakeholders  \\n- Deliver work to expected standards and within stipulated timelines  \\n- Establish project information systems for effective monitoring  \\n- Track and monitor project activities, budgets, and timelines per organizational procedures  \\n- Consult on and collect relevant information for project evaluation  \\n- Communicate information regarding monitoring and evaluation to designated individuals\", \"knowledge_understanding\": \"- Understand the key aims and objectives of the projects  \\n- Identify individuals to align on roles and activities  \\n- Comprehend work activities, timelines, and budgets related to the projects  \\n- Knowledge of organizational procedures for tracking and monitoring projects  \\n- Understand the types of information necessary for project evaluation and methods for collection and storage  \\n- Recognize when and to whom information should be communicated\", \"score\": 0.752479076385498}]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "9adbed9a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['COGPACK46', 'SCDLMCSE11', 'SFTDW13', 'ECIPMA5', 'CCSAPLE30']"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nos_results = [res['nos_id'] for res in results]\n",
    "nos_results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "26130b38-ae45-4985-a7bd-d47d685c254b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: level)} {position: line: 5, column: 7, offset: 165} for query: '\\n    MATCH (n:NOSNode {nos_id: $nos_id})-[:MAPS_TO]->(o:OFQUALUnit)\\n    RETURN o.unit_id AS unit_id, o.unit_title AS unit_title, \\n    o.overview AS overview, \\n    o.level AS level, \\n    o.qualification_type AS qualification_type, \\n    o.qualification_level AS qualification_level, \\n    o.awarding_organisation AS awarding_organisation, \\n    o.total_credits AS total_credits, \\n    o.guided_learning_hours AS guided_learning_hours, \\n    o.total_qualification_time AS total_qualification_time, \\n    o.unit_learning_outcomes AS learning_outcomes, \\n    o.assessment_methods AS assessment_methods,\\n    o.marksscheme AS marksscheme\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: marksscheme)} {position: line: 14, column: 7, offset: 598} for query: '\\n    MATCH (n:NOSNode {nos_id: $nos_id})-[:MAPS_TO]->(o:OFQUALUnit)\\n    RETURN o.unit_id AS unit_id, o.unit_title AS unit_title, \\n    o.overview AS overview, \\n    o.level AS level, \\n    o.qualification_type AS qualification_type, \\n    o.qualification_level AS qualification_level, \\n    o.awarding_organisation AS awarding_organisation, \\n    o.total_credits AS total_credits, \\n    o.guided_learning_hours AS guided_learning_hours, \\n    o.total_qualification_time AS total_qualification_time, \\n    o.unit_learning_outcomes AS learning_outcomes, \\n    o.assessment_methods AS assessment_methods,\\n    o.marksscheme AS marksscheme\\n    '\n"
     ]
    }
   ],
   "source": [
    "ofqual_results = retrieve_ofquals_from_neo4j('COGPACK46')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "0b13db09",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ofqual_results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "52e14cb5",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: NOS)} {position: line: 1, column: 10, offset: 9} for query: 'MATCH (n:NOS) WHERE n.embedding IS NOT NULL RETURN COUNT(n) AS indexed_documents;'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "([[0]], ['indexed_documents'])"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\"MATCH (n:NOS) WHERE n.embedding IS NOT NULL RETURN COUNT(n) AS indexed_documents;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "96da3563",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
