{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# docker run -p 7474:7474 -p 7687:7687 -d -e NEO4J_AUTH=neo4j/secretgraph neo4j:latest"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "## neo4j instance\n",
    "# docker run -p 7474:7474 -p 7687:7687 -d -e NEO4J_AUTH=neo4j/zavmoadmin neo4j:latest  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import os\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "ofqual_SSAs = json.load(open(os.path.join(os.getcwd(), \"zavmo-api/zavmo/classification/data\", \"ofqual_SSAs.json\")))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.chdir(\"/Users/mumtaz/Documents/projects/zavmo/zavmo-api\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from openai import OpenAI\n",
    "\n",
    "client = OpenAI(api_key=os.getenv(\"OPENAI_API_KEY\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def get_batch_list(texts):\n",
    "    batches = []\n",
    "    current_batch = []\n",
    "    current_batch_length = 0\n",
    "    # Set a conservative max length per batch (characters)\n",
    "    # OpenAI's text-embedding-3-small has an 8192 token limit\n",
    "    # A rough estimate is ~4 characters per token, so ~32,000 chars should be safe\n",
    "    max_batch_length = 30000\n",
    "    \n",
    "    for text in texts:\n",
    "        text_length = len(text)\n",
    "        \n",
    "        # If a single text is too long, truncate it\n",
    "        if text_length > max_batch_length:\n",
    "            text = text[:max_batch_length]\n",
    "            text_length = max_batch_length\n",
    "            \n",
    "        # If adding this text would exceed the batch limit, start a new batch\n",
    "        if current_batch_length + text_length > max_batch_length and current_batch:\n",
    "            batches.append(current_batch)\n",
    "            current_batch = []\n",
    "            current_batch_length = 0\n",
    "            \n",
    "        # Add the text to the current batch\n",
    "        current_batch.append(text)\n",
    "        current_batch_length += text_length\n",
    "        \n",
    "    # Add the last batch if it's not empty\n",
    "    if current_batch:\n",
    "        batches.append(current_batch)\n",
    "        \n",
    "    return batches\n",
    "\n",
    "def get_batch_openai_embedding(texts: list, model=\"text-embedding-3-small\", **kwargs):\n",
    "    \"\"\"\n",
    "    Get embeddings of a batch of texts from OpenAI API.\n",
    "\n",
    "    Args:\n",
    "        texts (list): List of texts to get embeddings for.\n",
    "        model (str): Model to use for embeddings.\n",
    "        **kwargs: Additional arguments to pass to the OpenAI API.\n",
    "    Returns:\n",
    "        list[list]: List of embeddings of the texts.\n",
    "    \"\"\"\n",
    "    text_batches = get_batch_list(texts)\n",
    "    print(f\"total batches: {len(text_batches)}\")\n",
    "    embeddings = []\n",
    "    for text_batch in text_batches:\n",
    "        response = client.embeddings.create(\n",
    "            model=model,\n",
    "            input=text_batch,\n",
    "            **kwargs,\n",
    "        )\n",
    "        embeddings += [r.embedding for r in response.data]\n",
    "    return embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "## zavmo neo4j instance\n",
    "uri = \"neo4j://51.20.45.38:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"zavmoadmin\"\n",
    "\n",
    "## local neo4j instance\n",
    "uri = \"neo4j://localhost:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"secretgraph\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection established.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "    driver.verify_connectivity()\n",
    "    print(\"Connection established.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "nos = pd.read_excel(r\"/Users/mumtaz/Documents/projects/zavmo/zavmo-api/zavmo/classification/data/predicted/missed_nos_records_with_predictions.xlsx\")\n",
    "nos.rename(columns={'predicted_sub_SSA': 'sub_SSA'}, inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "ofqual = pd.read_csv(\"/Users/mumtaz/Documents/projects/zavmo/zavmo-api/docs/nos-ofqual/ofqual.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Testing NOS and OFQUAL for People Partner role"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(26, 8)"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample_ofqual = \"601/5198/5, 600/5436/0, 603/6728/3, 603/2870/8, 601/5196/1, 601/6049/4, 603/2870/8, 603/4688/7, 601/8691/4, 603/0322/0\".split(\", \")\n",
    "sample_ofqual = ofqual[ofqual['ofqual_id'].isin(sample_ofqual)].reset_index(drop=True)\n",
    "sample_ofqual.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(6, 10)"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample_nos = \"SFJCCBE4.1, INSML021, PROMPR4, SFJHD2, SFJCCBE2.1, INSML017\".split(\", \")\n",
    "sample_nos = nos[nos['nos_id'].isin(sample_nos)].reset_index(drop=True)\n",
    "sample_nos.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import StructuredNode, StringProperty, RelationshipTo, config, db, ArrayProperty, FloatProperty\n",
    "\n",
    "# Configure the connection to Neo4j\n",
    "config.DATABASE_URL = \"bolt://neo4j:secretgraph@localhost:7687\"\n",
    "\n",
    "class SSA(StructuredNode):\n",
    "    name = StringProperty(unique=True)\n",
    "    sub_ssas = RelationshipTo('SubSSA', 'HAS_SUB_SSA')\n",
    "\n",
    "class SubSSA(StructuredNode):\n",
    "    name = StringProperty(unique=True)\n",
    "    ssa = RelationshipTo(SSA, 'BELONGS_TO')\n",
    "    nos_documents = RelationshipTo('NOS', 'HAS_NOS')\n",
    "    ofqual_documents = RelationshipTo('OFQUAL', 'HAS_OFQUAL')\n",
    "\n",
    "class OFQUAL(StructuredNode):\n",
    "    ofqual_id = StringProperty(unique=True, required=True, primary_key=True)\n",
    "    unit_id = StringProperty(unique=True) \n",
    "    title = StringProperty(unique=True)\n",
    "    overview = StringProperty()\n",
    "    description = StringProperty()\n",
    "    learning_outcomes = StringProperty()\n",
    "    embedding = ArrayProperty(base_property=FloatProperty())\n",
    "    \n",
    "    sub_ssa = RelationshipTo(SubSSA, 'BELONGS_TO')\n",
    "    ssa = RelationshipTo(SSA, 'BELONGS_TO')\n",
    "\n",
    "class NOS(StructuredNode):\n",
    "    nos_id = StringProperty(unique=True, required=True, primary_key=True)\n",
    "    title = StringProperty()\n",
    "    overview = StringProperty()\n",
    "    performance_criteria = StringProperty()\n",
    "    knowledge_criteria = StringProperty()\n",
    "    nos_industry = StringProperty()\n",
    "    keywords = StringProperty()\n",
    "    relevant_roles = StringProperty()\n",
    "    embedding = ArrayProperty(base_property=FloatProperty())\n",
    "    \n",
    "    sub_ssa = RelationshipTo(SubSSA, 'BELONGS_TO')\n",
    "    ssa = RelationshipTo(SSA, 'BELONGS_TO')\n",
    "\n",
    "    ofquals = RelationshipTo(\"OFQUAL\", \"RELATED_TO\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SSA and Sub_SSA - Nodes Creation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "category_mapping = {\n",
    "    sub_category: parent_category\n",
    "        for category_dict in ofqual_SSAs \n",
    "        for parent_category, sub_categories in category_dict.items()\n",
    "        for sub_category in sub_categories\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "SubSSAs = [(key, value) for key, value in category_mapping.items()]\n",
    "SSAs    = [list(ofqual_SSA.keys())[0] for ofqual_SSA in ofqual_SSAs]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(15, 50)"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(SSAs), len(SubSSAs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "ssa_nodes = {}\n",
    "for name in SSAs:\n",
    "    ssa = SSA(name=name).save()\n",
    "    ssa_nodes[name] = ssa"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SSA and SubSSA nodes created successfully!\n"
     ]
    }
   ],
   "source": [
    "# Creating SubSSA nodes and linking them to SSA\n",
    "sub_ssa_nodes = {}\n",
    "for sub_ssa_name, ssa_name in SubSSAs:\n",
    "    sub_ssa = SubSSA(name=sub_ssa_name).save()\n",
    "    sub_ssa.ssa.connect(ssa_nodes[ssa_name])\n",
    "    sub_ssa_nodes[sub_ssa_name] = sub_ssa\n",
    "\n",
    "print(\"SSA and SubSSA nodes created successfully!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import db\n",
    "\n",
    "class VectorIndex:\n",
    "    def __init__(self, node, index_name=\"test_embedding_index\", dimension=1536, similarity_function=\"cosine\"):\n",
    "        self.index_name = index_name\n",
    "        self.dimension = dimension\n",
    "        self.similarity_function = similarity_function\n",
    "        self.node = node\n",
    "    \n",
    "    def index_exists(self):\n",
    "        \"\"\"Checks if the vector index exists.\"\"\"\n",
    "        query = \"\"\"\n",
    "        SHOW INDEXES\n",
    "        \"\"\"\n",
    "        results, _ = db.cypher_query(query)\n",
    "        \n",
    "        # Extract the index names from the results\n",
    "        index_names = [row[0] for row in results]  # Adjust this based on Neo4j version\n",
    "        return self.index_name in index_names\n",
    "\n",
    "    def list_vector_indexes(self):\n",
    "        \"\"\"Lists all vector indexes.\"\"\"\n",
    "        query = \"\"\"\n",
    "        SHOW INDEXES\n",
    "        \"\"\"\n",
    "        results, _ = db.cypher_query(query)\n",
    "        return results\n",
    "\n",
    "    def create_vector_index(self):\n",
    "        \"\"\"Creates a vector index if it does not exist.\"\"\"\n",
    "\n",
    "        query = f\"\"\"\n",
    "        CREATE VECTOR INDEX {self.index_name} \n",
    "        FOR (n:{self.node}) \n",
    "        ON (n.embedding) \n",
    "        OPTIONS {{indexConfig: {{`vector.dimensions`: {self.dimension}, `vector.similarity_function`: \"{self.similarity_function}\"}}}};\n",
    "        \"\"\"\n",
    "        try:\n",
    "            db.cypher_query(query)\n",
    "            print(f\"Vector index '{self.index_name}' created successfully.\")\n",
    "        except Exception as e:\n",
    "            print(f\"\")\n",
    "\n",
    "    def delete_vector_index(self):\n",
    "        \"\"\"Deletes the vector index if it exists.\"\"\"\n",
    "        query = f\"DROP INDEX {self.index_name};\"\n",
    "        try:\n",
    "            db.cypher_query(query)\n",
    "            print(f\"Vector index '{self.index_name}' deleted successfully.\")\n",
    "        except Exception as e:\n",
    "            print(f\"Error deleting vector index: {e}\")\n",
    "    \n",
    "    def retrieve_nos(self, query_embedding, top_k=5):\n",
    "        query = f\"\"\"\n",
    "            CALL db.index.vector.queryNodes('{self.index_name}', $top_k, $query_embedding) \n",
    "            YIELD node, score\n",
    "            OPTIONAL MATCH (node)-[:BELONGS_TO]->(ssa:SSA)\n",
    "            OPTIONAL MATCH (node)-[:BELONGS_TO]->(subssa:SubSSA)\n",
    "            OPTIONAL MATCH (node)-[:RELATED_TO]->(ofqual:OFQUAL)\n",
    "            RETURN \n",
    "                node.nos_id AS nos_id, \n",
    "                node.title AS title, \n",
    "                COLLECT(ofqual.ofqual_id) AS ofqual_ids, \n",
    "                COLLECT(ofqual.unit_id) AS ofqual_units,\n",
    "                COLLECT(ofqual.learning_outcomes) AS ofqual_learning_outcomes,\n",
    "                score\n",
    "            ORDER BY score DESC\n",
    "        \"\"\"\n",
    "\n",
    "        result, columns = db.cypher_query(query, {\"query_embedding\": query_embedding, \"top_k\": top_k})\n",
    "        \n",
    "        formatted_result = [dict(zip(columns, row)) for row in result]\n",
    "        \n",
    "        return formatted_result\n",
    "\n",
    "    def drop_all_vector_records(self,):\n",
    "        \"\"\"\n",
    "        Deletes all records of a given Neomodel class from the Neo4j database.\n",
    "        \"\"\"\n",
    "        query = f\"MATCH (n:{self.node}) DETACH DELETE n\"\n",
    "        db.cypher_query(query)\n",
    "        print(f\"All records from '{self.node}' have been deleted, but the index remains intact.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## OFQUAL - Nodes Creation, Database Ingestion, Vector Index Creation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "def ingest_ofqual_to_db(ofqual_list):\n",
    "    with db.transaction:\n",
    "        \n",
    "        for ofqual in ofqual_list:\n",
    "            ssa_node = SSA.nodes.get(name=ofqual[\"SSA\"])\n",
    "            sub_ssa_node = SubSSA.nodes.get(name=ofqual[\"sub_SSA\"])\n",
    "            ofqual_node = OFQUAL(\n",
    "                ofqual_id=ofqual[\"ofqual_id\"],\n",
    "                unit_id=ofqual[\"id\"],\n",
    "                title=ofqual[\"title\"],\n",
    "                overview=ofqual[\"overview\"],\n",
    "                description=ofqual[\"description\"],\n",
    "                learning_outcomes=ofqual[\"learning_outcomes\"],\n",
    "                embedding=ofqual[\"embedding\"]\n",
    "            ).save()\n",
    "\n",
    "            # Link OFQUAL to SSA and SubSSA\n",
    "            ofqual_node.ssa.connect(ssa_node)\n",
    "            ofqual_node.sub_ssa.connect(sub_ssa_node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "def store_ofqual():\n",
    "    ofqual_list = sample_ofqual.to_dict(orient=\"records\")\n",
    "    ofqual_texts_for_embeddings = [f\"Sector Subject Area: {ofqual['SSA']}\\n\\nSub Sector Subject Area: {ofqual['sub_SSA']}\\n\\nTitle: {ofqual['title']}\\n\\nDescription: {ofqual['description']}\\n\\nOverview: {ofqual['overview']}\" for ofqual in ofqual_list]\n",
    "    \n",
    "    embeddings = get_batch_openai_embedding(ofqual_texts_for_embeddings)\n",
    "\n",
    "    sample_ofqual['embedding'] = embeddings\n",
    "    ingest_ofqual_to_db(sample_ofqual.to_dict(orient=\"records\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "total batches: 1\n"
     ]
    }
   ],
   "source": [
    "ofqual_index = VectorIndex(\"OFQUAL\", index_name=\"ofqual_embedding_index\")\n",
    "# ofqual_index.delete_vector_index()\n",
    "ofqual_index.create_vector_index()\n",
    "# ofqual_index.index_exists()\n",
    "store_ofqual()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[26]], ['indexed_documents'])"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\"MATCH (n:OFQUAL) WHERE n.embedding IS NOT NULL RETURN COUNT(n) AS indexed_documents;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(26, 9)"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample_ofqual.shape"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## NOS Nodes Creation, Database Ingestion, Vector Index Creation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(6, 11)"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# sample_nos['sub_SSA'] = \"Business management\"\n",
    "# sample_nos['SSA'] = \"Business, Administration and Law\"\n",
    "# sample_nos.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['nos_id', 'industry', 'title', 'overview', 'performance_criteria',\n",
       "       'knowledge_understanding', 'keywords', 'relevant_roles', 'SSA',\n",
       "       'sub_SSA'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample_nos.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "from sklearn.metrics.pairwise import cosine_similarity\n",
    "import numpy as np\n",
    "\n",
    "def find_relevant_ofquals(nos_node):\n",
    "    \"\"\"Find relevant Ofquals based on SSA, Sub-SSA, and embedding similarity.\"\"\"\n",
    "    \n",
    "    ssa_node = nos_node.ssa.single()\n",
    "    sub_ssa_node = nos_node.sub_ssa.single()\n",
    "    \n",
    "    if not ssa_node or not sub_ssa_node:\n",
    "        return []\n",
    "\n",
    "    ofqual_candidates = []\n",
    "    for ofqual in OFQUAL.nodes.all():\n",
    "        if ofqual.ssa.single() == ssa_node and ofqual.sub_ssa.single() == sub_ssa_node:\n",
    "            ofqual_candidates.append(ofqual)\n",
    "    \n",
    "    if ofqual_candidates:\n",
    "        nos_embedding =  np.array(nos_node.embedding).reshape(1, -1) \n",
    "        print(f\"Embeddings present for NOS: {nos_node.nos_id} and found {len(ofqual_candidates)} candidates\")\n",
    "        best_matches = []\n",
    "        for ofqual in ofqual_candidates:\n",
    "            ofqual_embedding =  np.array(ofqual.embedding).reshape(1, -1) \n",
    "            similarity = cosine_similarity(nos_embedding, ofqual_embedding)[0][0]\n",
    "            # if similarity > 0.75:  # Set a relevance threshold\n",
    "            best_matches.append((ofqual, similarity))\n",
    "        \n",
    "        # Sort by highest similarity\n",
    "        best_matches.sort(key=lambda x: x[1], reverse=True)\n",
    "        return [match[0] for match in best_matches][:10]\n",
    "    else:\n",
    "        print(f\"No ofqual candidates found for NOS: {nos_node.nos_id}\")\n",
    "    \n",
    "    return list(ofqual_candidates)  # If no embeddings, return SSA-matched Ofquals\n",
    "\n",
    "\n",
    "def ingest_nos_to_db_with_ofqual(nos_list):\n",
    "    with db.transaction:\n",
    "        for nos in nos_list:\n",
    "            # Get SSA & SubSSA nodes\n",
    "            ssa_node = SSA.nodes.get(name=nos[\"SSA\"])\n",
    "            sub_ssa_node = SubSSA.nodes.get(name=nos[\"sub_SSA\"])\n",
    "            if not ssa_node or not sub_ssa_node:\n",
    "                continue\n",
    "            \n",
    "            nos_node = NOS(\n",
    "                    nos_id=nos[\"nos_id\"],\n",
    "                    title=nos[\"title\"],\n",
    "                    overview=nos[\"overview\"],\n",
    "                    performance_criteria=nos[\"performance_criteria\"],\n",
    "                    knowledge_criteria=nos[\"knowledge_understanding\"],\n",
    "                    nos_industry=nos[\"industry\"],\n",
    "                    keywords=nos[\"keywords\"],\n",
    "                    relevant_roles=nos[\"relevant_roles\"],\n",
    "                    embedding=nos[\"embedding\"]\n",
    "                ).save()\n",
    "                \n",
    "            nos_node.ssa.connect(ssa_node)\n",
    "            nos_node.sub_ssa.connect(sub_ssa_node)\n",
    "            \n",
    "            # # Find relevant Ofquals\n",
    "            relevant_ofquals = find_relevant_ofquals(nos_node)\n",
    "            for ofqual in relevant_ofquals:\n",
    "                if not nos_node.ofquals.is_connected(ofqual):\n",
    "                    nos_node.ofquals.connect(ofqual)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "def store_nos_with_ofqual():\n",
    "    nos_list = sample_nos.to_dict(orient=\"records\")\n",
    "\n",
    "    nos_texts_for_embeddings = [f\"Sector Subject Area: {nos['SSA']}\\n\\nSub Sector Subject Area: {nos['sub_SSA']}\\n\\nIndustry: {nos['industry']}\\n\\nTitle: {nos['title']}\\n\\nOverview:{nos['overview']}\"\n",
    "                                for nos in nos_list]\n",
    "    \n",
    "    embeddings = get_batch_openai_embedding(nos_texts_for_embeddings)\n",
    "    sample_nos['embedding'] = embeddings\n",
    "    ingest_nos_to_db_with_ofqual(sample_nos.to_dict(orient=\"records\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(6, 10)"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample_nos.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Vector index 'nos_embedding_index' created successfully.\n",
      "total batches: 1\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: RELATED_TO)} {position: line: 1, column: 66, offset: 65} for query: 'MATCH (nos) WHERE elementId(nos)=$nos_1 WITH nos MATCH (nos)-[r1:`RELATED_TO`]->(ofquals_r1:OFQUAL) WHERE elementId(ofquals_r1) = $ofquals_r1_contains_1 WITH ofquals_r1 RETURN count(ofquals_r1)'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embeddings present for NOS: INSML017 and found 4 candidates\n",
      "Embeddings present for NOS: INSML021 and found 4 candidates\n",
      "No ofqual candidates found for NOS: PROMPR4\n",
      "Embeddings present for NOS: SFJCCBE2.1 and found 4 candidates\n",
      "Embeddings present for NOS: SFJCCBE4.1 and found 4 candidates\n",
      "No ofqual candidates found for NOS: SFJHD2\n"
     ]
    }
   ],
   "source": [
    "nos_index = VectorIndex(\"NOS\", index_name=\"nos_embedding_index\")\n",
    "# nos_index.delete_vector_index()\n",
    "nos_index.create_vector_index()\n",
    "# # nos_index.index_exists()\n",
    "store_nos_with_ofqual()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[6]], ['indexed_documents'])"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\"MATCH (n:NOS) WHERE n.embedding IS NOT NULL RETURN COUNT(n) AS indexed_documents;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "All records from 'NOS' have been deleted, but the index remains intact.\n"
     ]
    }
   ],
   "source": [
    "# nos_index.drop_all_vector_records()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Querying"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "total batches: 1\n"
     ]
    }
   ],
   "source": [
    "query_text = \"\"\"Sector Subject Area: Business, Administration and Law\n",
    "Sub Sector Subject Area: Business management\n",
    "\n",
    "The People Partner works within the People Partnering team to support the delivery of the overarching people plan of the Business Unit and Centrica people strategy.\n",
    "The People Partner works at pace to diagnose, design and deliver the best People solutions required for delivering the people plan, linking in with People Consultants, Centres of Excellence and other HR shared services to leverage key expertise / ensure consistent delivery.\n",
    "Working as part of a flexible people partnering team ensuring business intimacy & commerciality to provide business support where needed. Providing professional end to end HR expertise, coaching & support to business leaders.\"\"\"\n",
    "query_embedding = get_batch_openai_embedding([query_text])[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.AggregationSkippedNull} {category: UNRECOGNIZED} {title: The query contains an aggregation function that skips null values.} {description: null value eliminated in set function.} {position: None} for query: \"\\n            CALL db.index.vector.queryNodes('nos_embedding_index', $top_k, $query_embedding) \\n            YIELD node, score\\n            OPTIONAL MATCH (node)-[:BELONGS_TO]->(ssa:SSA)\\n            OPTIONAL MATCH (node)-[:BELONGS_TO]->(subssa:SubSSA)\\n            OPTIONAL MATCH (node)-[:RELATED_TO]->(ofqual:OFQUAL)\\n            RETURN \\n                node.nos_id AS nos_id, \\n                node.title AS title, \\n                COLLECT(ofqual.ofqual_id) AS ofqual_ids, \\n                COLLECT(ofqual.unit_id) AS ofqual_units,\\n                COLLECT(ofqual.learning_outcomes) AS ofqual_learning_outcomes,\\n                score\\n            ORDER BY score DESC\\n        \"\n"
     ]
    }
   ],
   "source": [
    "nos_index = VectorIndex(\"NOS\", index_name=\"nos_embedding_index\")\n",
    "results = nos_index.retrieve_nos(query_embedding, top_k=10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nos_id': 'SFJCCBE4.1',\n",
       "  'title': 'Implement Change',\n",
       "  'ofqual_ids': ['603/2870/8', '603/2870/8', '603/2870/8', '603/2870/8'],\n",
       "  'ofqual_units': ['L/616/8107', 'J/616/8106', 'L/616/8110', 'Y/616/8109'],\n",
       "  'ofqual_learning_outcomes': ['[{\"description\": \"Understand the principles of business strategy\", \"assessment_criteria\": [\"Explain why strategy is important to a business\", \"Critically compare distinct types of business strategies\", \"Evaluate how organisational structure and culture influence business strategy\", \"Compare different strategies and how these impact on an organisation\"]}, {\"description\": \"Use a strategic planning approach to inform business strategy\", \"assessment_criteria\": [\"Differentiate between operational, tactical and strategic planning\", \"Conduct an internal and external environmental scan\", \"Determine organisation\\\\u2019s strategic capacity\", \"Create a strategy framework to communicate vision, values and goals\", \"Recommend strategic actions based on the application of an appropriate planning model\"]}, {\"description\": \"Implement strategic business decisions\", \"assessment_criteria\": [\"Describe the relationships between strategic intentions, strategic choice and strategy formulation\", \"Apply a strategy implementation process in context\", \"Ascertain the possible impacts of strategy implementation on a business\", \"Apply techniques to monitor and adjust a strategic plan in context\"]}, {\"description\": \"Reflect on the development of a business strategy\", \"assessment_criteria\": [\"Critically evaluate the strategic plan\", \"Critically evaluate the implementation phase of the plan\", \"Recommend ways in which the development of business strategy could be improved\", \"Explain the value of own contribution to a business strategy\"]}]',\n",
       "   '[{\"description\": \"Lead a team to deliver objectives\", \"assessment_criteria\": [\"Apply techniques to motivate individuals and teams to improve performance\", \"Demonstrate leadership qualities to achieve organisational objectives\", \"Evaluate own leadership style\"]}, {\"description\": \"Manage resources\", \"assessment_criteria\": [\"Assess the level of knowledge, skills and competencies within a team\", \"Determine resource requirements for tasks or objectives\", \"Apply techniques to efficiently allocate resources to achieve objectives\", \"Manage resources in line with organisational requirements\"]}, {\"description\": \"Understand the importance of stakeholder engagement\", \"assessment_criteria\": [\"Critically compare ways to effectively engage with internal and external stakeholders\", \"Evaluate organisational stakeholder management strategies\", \"Evaluate methods of communication appropriate for use with stakeholders\", \"Describe ways in which stakeholders support leadership and management behaviours\"]}, {\"description\": \"Understand how organisational structure and culture influences leadership and management\", \"assessment_criteria\": [\"Describe ways in which an organisation\\\\u2019s culture and structure influence behaviour\", \"Describe ways in which authority and systems impact on individual and team behaviour\", \"Evaluate the impact of organisational politics and power on individuals and teams\"]}]',\n",
       "   '[{\"description\": \"Understand decision-making as a concept and as a process\", \"assessment_criteria\": [\"Critically compare features of a decision-making process\", \"Explain why legal and ethical considerations are important to decision-making\", \"Describe the relationship between decision-making and business strategy\", \"Evaluate the use of a decision-making approach in context\"]}, {\"description\": \"Use financial and non-financial information to inform decision making\", \"assessment_criteria\": [\"Differentiate between financial and non-financial information\", \"Compare relevant primary and secondary sources of information\", \"Apply techniques to control and secure data and information\", \"Use qualitative and quantitative information to evaluate the decisions made\"]}, {\"description\": \"Adopt a logical and systematic approach to decision making\", \"assessment_criteria\": [\"Demonstrate a logical approach to solving a problem or dealing with a situation\", \"Differentiate between inductive and deductive reasoning\", \"Recommend actions based on reliable and valid approaches to decision-making\"]}, {\"description\": \"Employ appropriate techniques and models to the decision-making process\", \"assessment_criteria\": [\"Engage stakeholders in the decision-making process\", \"Compare decision-making techniques and models\", \"Employ an appropriate decision-making technique or model in context\", \"Reflect on the extent to which implemented decisions have been successful\"]}]',\n",
       "   '[{\"description\": \"Understand the factors which drive organisational change\", \"assessment_criteria\": [\"Describe techniques used to analyse the internal and external environment\", \"Describe external factors which drive organisational change\", \"Describe internal factors which drive organisational change\", \"Explain which drivers are most likely to impact own organisation\"]}, {\"description\": \"Apply techniques to plan, manage and evaluate change\", \"assessment_criteria\": [\"Apply a change management process to a change initiative\", \"Apply techniques to establish change supporters and change resistors\", \"Assess the extent to which change has been successful based on pre-defined benchmarks\", \"Reflect on the lessons learned from leading a change initiative\"]}, {\"description\": \"Provide effective leadership during a period of change\", \"assessment_criteria\": [\"Demonstrate leadership styles dependent on the stage of the change initiative\", \"Maintain an effective team during a period of change\"]}, {\"description\": \"Understand the impact of change on an organisation and its stakeholders\", \"assessment_criteria\": [\"Explain ways in which stakeholders resist change\", \"Explain how the change transition cycle helps leaders to support stakeholders during change\", \"Explain ways to measure impact of change on an organisation and its strategic direction\", \"Describe ways own organisation can change to maintain or improve market position\"]}]'],\n",
       "  'score': 0.8054885864257812},\n",
       " {'nos_id': 'SFJHD2',\n",
       "  'title': 'Develop productive working relationships with colleagues and stakeholders',\n",
       "  'ofqual_ids': [],\n",
       "  'ofqual_units': [],\n",
       "  'ofqual_learning_outcomes': [],\n",
       "  'score': 0.7861053943634033},\n",
       " {'nos_id': 'SFJCCBE2.1',\n",
       "  'title': 'Lead Change',\n",
       "  'ofqual_ids': ['603/2870/8', '603/2870/8', '603/2870/8', '603/2870/8'],\n",
       "  'ofqual_units': ['L/616/8110', 'J/616/8106', 'L/616/8107', 'Y/616/8109'],\n",
       "  'ofqual_learning_outcomes': ['[{\"description\": \"Understand decision-making as a concept and as a process\", \"assessment_criteria\": [\"Critically compare features of a decision-making process\", \"Explain why legal and ethical considerations are important to decision-making\", \"Describe the relationship between decision-making and business strategy\", \"Evaluate the use of a decision-making approach in context\"]}, {\"description\": \"Use financial and non-financial information to inform decision making\", \"assessment_criteria\": [\"Differentiate between financial and non-financial information\", \"Compare relevant primary and secondary sources of information\", \"Apply techniques to control and secure data and information\", \"Use qualitative and quantitative information to evaluate the decisions made\"]}, {\"description\": \"Adopt a logical and systematic approach to decision making\", \"assessment_criteria\": [\"Demonstrate a logical approach to solving a problem or dealing with a situation\", \"Differentiate between inductive and deductive reasoning\", \"Recommend actions based on reliable and valid approaches to decision-making\"]}, {\"description\": \"Employ appropriate techniques and models to the decision-making process\", \"assessment_criteria\": [\"Engage stakeholders in the decision-making process\", \"Compare decision-making techniques and models\", \"Employ an appropriate decision-making technique or model in context\", \"Reflect on the extent to which implemented decisions have been successful\"]}]',\n",
       "   '[{\"description\": \"Lead a team to deliver objectives\", \"assessment_criteria\": [\"Apply techniques to motivate individuals and teams to improve performance\", \"Demonstrate leadership qualities to achieve organisational objectives\", \"Evaluate own leadership style\"]}, {\"description\": \"Manage resources\", \"assessment_criteria\": [\"Assess the level of knowledge, skills and competencies within a team\", \"Determine resource requirements for tasks or objectives\", \"Apply techniques to efficiently allocate resources to achieve objectives\", \"Manage resources in line with organisational requirements\"]}, {\"description\": \"Understand the importance of stakeholder engagement\", \"assessment_criteria\": [\"Critically compare ways to effectively engage with internal and external stakeholders\", \"Evaluate organisational stakeholder management strategies\", \"Evaluate methods of communication appropriate for use with stakeholders\", \"Describe ways in which stakeholders support leadership and management behaviours\"]}, {\"description\": \"Understand how organisational structure and culture influences leadership and management\", \"assessment_criteria\": [\"Describe ways in which an organisation\\\\u2019s culture and structure influence behaviour\", \"Describe ways in which authority and systems impact on individual and team behaviour\", \"Evaluate the impact of organisational politics and power on individuals and teams\"]}]',\n",
       "   '[{\"description\": \"Understand the principles of business strategy\", \"assessment_criteria\": [\"Explain why strategy is important to a business\", \"Critically compare distinct types of business strategies\", \"Evaluate how organisational structure and culture influence business strategy\", \"Compare different strategies and how these impact on an organisation\"]}, {\"description\": \"Use a strategic planning approach to inform business strategy\", \"assessment_criteria\": [\"Differentiate between operational, tactical and strategic planning\", \"Conduct an internal and external environmental scan\", \"Determine organisation\\\\u2019s strategic capacity\", \"Create a strategy framework to communicate vision, values and goals\", \"Recommend strategic actions based on the application of an appropriate planning model\"]}, {\"description\": \"Implement strategic business decisions\", \"assessment_criteria\": [\"Describe the relationships between strategic intentions, strategic choice and strategy formulation\", \"Apply a strategy implementation process in context\", \"Ascertain the possible impacts of strategy implementation on a business\", \"Apply techniques to monitor and adjust a strategic plan in context\"]}, {\"description\": \"Reflect on the development of a business strategy\", \"assessment_criteria\": [\"Critically evaluate the strategic plan\", \"Critically evaluate the implementation phase of the plan\", \"Recommend ways in which the development of business strategy could be improved\", \"Explain the value of own contribution to a business strategy\"]}]',\n",
       "   '[{\"description\": \"Understand the factors which drive organisational change\", \"assessment_criteria\": [\"Describe techniques used to analyse the internal and external environment\", \"Describe external factors which drive organisational change\", \"Describe internal factors which drive organisational change\", \"Explain which drivers are most likely to impact own organisation\"]}, {\"description\": \"Apply techniques to plan, manage and evaluate change\", \"assessment_criteria\": [\"Apply a change management process to a change initiative\", \"Apply techniques to establish change supporters and change resistors\", \"Assess the extent to which change has been successful based on pre-defined benchmarks\", \"Reflect on the lessons learned from leading a change initiative\"]}, {\"description\": \"Provide effective leadership during a period of change\", \"assessment_criteria\": [\"Demonstrate leadership styles dependent on the stage of the change initiative\", \"Maintain an effective team during a period of change\"]}, {\"description\": \"Understand the impact of change on an organisation and its stakeholders\", \"assessment_criteria\": [\"Explain ways in which stakeholders resist change\", \"Explain how the change transition cycle helps leaders to support stakeholders during change\", \"Explain ways to measure impact of change on an organisation and its strategic direction\", \"Describe ways own organisation can change to maintain or improve market position\"]}]'],\n",
       "  'score': 0.7815601825714111},\n",
       " {'nos_id': 'INSML017',\n",
       "  'title': 'Implement and evaluate change',\n",
       "  'ofqual_ids': ['603/2870/8', '603/2870/8', '603/2870/8', '603/2870/8'],\n",
       "  'ofqual_units': ['J/616/8106', 'Y/616/8109', 'L/616/8110', 'L/616/8107'],\n",
       "  'ofqual_learning_outcomes': ['[{\"description\": \"Lead a team to deliver objectives\", \"assessment_criteria\": [\"Apply techniques to motivate individuals and teams to improve performance\", \"Demonstrate leadership qualities to achieve organisational objectives\", \"Evaluate own leadership style\"]}, {\"description\": \"Manage resources\", \"assessment_criteria\": [\"Assess the level of knowledge, skills and competencies within a team\", \"Determine resource requirements for tasks or objectives\", \"Apply techniques to efficiently allocate resources to achieve objectives\", \"Manage resources in line with organisational requirements\"]}, {\"description\": \"Understand the importance of stakeholder engagement\", \"assessment_criteria\": [\"Critically compare ways to effectively engage with internal and external stakeholders\", \"Evaluate organisational stakeholder management strategies\", \"Evaluate methods of communication appropriate for use with stakeholders\", \"Describe ways in which stakeholders support leadership and management behaviours\"]}, {\"description\": \"Understand how organisational structure and culture influences leadership and management\", \"assessment_criteria\": [\"Describe ways in which an organisation\\\\u2019s culture and structure influence behaviour\", \"Describe ways in which authority and systems impact on individual and team behaviour\", \"Evaluate the impact of organisational politics and power on individuals and teams\"]}]',\n",
       "   '[{\"description\": \"Understand the factors which drive organisational change\", \"assessment_criteria\": [\"Describe techniques used to analyse the internal and external environment\", \"Describe external factors which drive organisational change\", \"Describe internal factors which drive organisational change\", \"Explain which drivers are most likely to impact own organisation\"]}, {\"description\": \"Apply techniques to plan, manage and evaluate change\", \"assessment_criteria\": [\"Apply a change management process to a change initiative\", \"Apply techniques to establish change supporters and change resistors\", \"Assess the extent to which change has been successful based on pre-defined benchmarks\", \"Reflect on the lessons learned from leading a change initiative\"]}, {\"description\": \"Provide effective leadership during a period of change\", \"assessment_criteria\": [\"Demonstrate leadership styles dependent on the stage of the change initiative\", \"Maintain an effective team during a period of change\"]}, {\"description\": \"Understand the impact of change on an organisation and its stakeholders\", \"assessment_criteria\": [\"Explain ways in which stakeholders resist change\", \"Explain how the change transition cycle helps leaders to support stakeholders during change\", \"Explain ways to measure impact of change on an organisation and its strategic direction\", \"Describe ways own organisation can change to maintain or improve market position\"]}]',\n",
       "   '[{\"description\": \"Understand decision-making as a concept and as a process\", \"assessment_criteria\": [\"Critically compare features of a decision-making process\", \"Explain why legal and ethical considerations are important to decision-making\", \"Describe the relationship between decision-making and business strategy\", \"Evaluate the use of a decision-making approach in context\"]}, {\"description\": \"Use financial and non-financial information to inform decision making\", \"assessment_criteria\": [\"Differentiate between financial and non-financial information\", \"Compare relevant primary and secondary sources of information\", \"Apply techniques to control and secure data and information\", \"Use qualitative and quantitative information to evaluate the decisions made\"]}, {\"description\": \"Adopt a logical and systematic approach to decision making\", \"assessment_criteria\": [\"Demonstrate a logical approach to solving a problem or dealing with a situation\", \"Differentiate between inductive and deductive reasoning\", \"Recommend actions based on reliable and valid approaches to decision-making\"]}, {\"description\": \"Employ appropriate techniques and models to the decision-making process\", \"assessment_criteria\": [\"Engage stakeholders in the decision-making process\", \"Compare decision-making techniques and models\", \"Employ an appropriate decision-making technique or model in context\", \"Reflect on the extent to which implemented decisions have been successful\"]}]',\n",
       "   '[{\"description\": \"Understand the principles of business strategy\", \"assessment_criteria\": [\"Explain why strategy is important to a business\", \"Critically compare distinct types of business strategies\", \"Evaluate how organisational structure and culture influence business strategy\", \"Compare different strategies and how these impact on an organisation\"]}, {\"description\": \"Use a strategic planning approach to inform business strategy\", \"assessment_criteria\": [\"Differentiate between operational, tactical and strategic planning\", \"Conduct an internal and external environmental scan\", \"Determine organisation\\\\u2019s strategic capacity\", \"Create a strategy framework to communicate vision, values and goals\", \"Recommend strategic actions based on the application of an appropriate planning model\"]}, {\"description\": \"Implement strategic business decisions\", \"assessment_criteria\": [\"Describe the relationships between strategic intentions, strategic choice and strategy formulation\", \"Apply a strategy implementation process in context\", \"Ascertain the possible impacts of strategy implementation on a business\", \"Apply techniques to monitor and adjust a strategic plan in context\"]}, {\"description\": \"Reflect on the development of a business strategy\", \"assessment_criteria\": [\"Critically evaluate the strategic plan\", \"Critically evaluate the implementation phase of the plan\", \"Recommend ways in which the development of business strategy could be improved\", \"Explain the value of own contribution to a business strategy\"]}]'],\n",
       "  'score': 0.765683650970459},\n",
       " {'nos_id': 'INSML021',\n",
       "  'title': 'Manage the redeployment of employees to new roles',\n",
       "  'ofqual_ids': ['603/2870/8', '603/2870/8', '603/2870/8', '603/2870/8'],\n",
       "  'ofqual_units': ['L/616/8110', 'J/616/8106', 'L/616/8107', 'Y/616/8109'],\n",
       "  'ofqual_learning_outcomes': ['[{\"description\": \"Understand decision-making as a concept and as a process\", \"assessment_criteria\": [\"Critically compare features of a decision-making process\", \"Explain why legal and ethical considerations are important to decision-making\", \"Describe the relationship between decision-making and business strategy\", \"Evaluate the use of a decision-making approach in context\"]}, {\"description\": \"Use financial and non-financial information to inform decision making\", \"assessment_criteria\": [\"Differentiate between financial and non-financial information\", \"Compare relevant primary and secondary sources of information\", \"Apply techniques to control and secure data and information\", \"Use qualitative and quantitative information to evaluate the decisions made\"]}, {\"description\": \"Adopt a logical and systematic approach to decision making\", \"assessment_criteria\": [\"Demonstrate a logical approach to solving a problem or dealing with a situation\", \"Differentiate between inductive and deductive reasoning\", \"Recommend actions based on reliable and valid approaches to decision-making\"]}, {\"description\": \"Employ appropriate techniques and models to the decision-making process\", \"assessment_criteria\": [\"Engage stakeholders in the decision-making process\", \"Compare decision-making techniques and models\", \"Employ an appropriate decision-making technique or model in context\", \"Reflect on the extent to which implemented decisions have been successful\"]}]',\n",
       "   '[{\"description\": \"Lead a team to deliver objectives\", \"assessment_criteria\": [\"Apply techniques to motivate individuals and teams to improve performance\", \"Demonstrate leadership qualities to achieve organisational objectives\", \"Evaluate own leadership style\"]}, {\"description\": \"Manage resources\", \"assessment_criteria\": [\"Assess the level of knowledge, skills and competencies within a team\", \"Determine resource requirements for tasks or objectives\", \"Apply techniques to efficiently allocate resources to achieve objectives\", \"Manage resources in line with organisational requirements\"]}, {\"description\": \"Understand the importance of stakeholder engagement\", \"assessment_criteria\": [\"Critically compare ways to effectively engage with internal and external stakeholders\", \"Evaluate organisational stakeholder management strategies\", \"Evaluate methods of communication appropriate for use with stakeholders\", \"Describe ways in which stakeholders support leadership and management behaviours\"]}, {\"description\": \"Understand how organisational structure and culture influences leadership and management\", \"assessment_criteria\": [\"Describe ways in which an organisation\\\\u2019s culture and structure influence behaviour\", \"Describe ways in which authority and systems impact on individual and team behaviour\", \"Evaluate the impact of organisational politics and power on individuals and teams\"]}]',\n",
       "   '[{\"description\": \"Understand the principles of business strategy\", \"assessment_criteria\": [\"Explain why strategy is important to a business\", \"Critically compare distinct types of business strategies\", \"Evaluate how organisational structure and culture influence business strategy\", \"Compare different strategies and how these impact on an organisation\"]}, {\"description\": \"Use a strategic planning approach to inform business strategy\", \"assessment_criteria\": [\"Differentiate between operational, tactical and strategic planning\", \"Conduct an internal and external environmental scan\", \"Determine organisation\\\\u2019s strategic capacity\", \"Create a strategy framework to communicate vision, values and goals\", \"Recommend strategic actions based on the application of an appropriate planning model\"]}, {\"description\": \"Implement strategic business decisions\", \"assessment_criteria\": [\"Describe the relationships between strategic intentions, strategic choice and strategy formulation\", \"Apply a strategy implementation process in context\", \"Ascertain the possible impacts of strategy implementation on a business\", \"Apply techniques to monitor and adjust a strategic plan in context\"]}, {\"description\": \"Reflect on the development of a business strategy\", \"assessment_criteria\": [\"Critically evaluate the strategic plan\", \"Critically evaluate the implementation phase of the plan\", \"Recommend ways in which the development of business strategy could be improved\", \"Explain the value of own contribution to a business strategy\"]}]',\n",
       "   '[{\"description\": \"Understand the factors which drive organisational change\", \"assessment_criteria\": [\"Describe techniques used to analyse the internal and external environment\", \"Describe external factors which drive organisational change\", \"Describe internal factors which drive organisational change\", \"Explain which drivers are most likely to impact own organisation\"]}, {\"description\": \"Apply techniques to plan, manage and evaluate change\", \"assessment_criteria\": [\"Apply a change management process to a change initiative\", \"Apply techniques to establish change supporters and change resistors\", \"Assess the extent to which change has been successful based on pre-defined benchmarks\", \"Reflect on the lessons learned from leading a change initiative\"]}, {\"description\": \"Provide effective leadership during a period of change\", \"assessment_criteria\": [\"Demonstrate leadership styles dependent on the stage of the change initiative\", \"Maintain an effective team during a period of change\"]}, {\"description\": \"Understand the impact of change on an organisation and its stakeholders\", \"assessment_criteria\": [\"Explain ways in which stakeholders resist change\", \"Explain how the change transition cycle helps leaders to support stakeholders during change\", \"Explain ways to measure impact of change on an organisation and its strategic direction\", \"Describe ways own organisation can change to maintain or improve market position\"]}]'],\n",
       "  'score': 0.7595956325531006},\n",
       " {'nos_id': 'PROMPR4',\n",
       "  'title': 'Promote equality of opportunity and diversity in your area of responsibility',\n",
       "  'ofqual_ids': [],\n",
       "  'ofqual_units': [],\n",
       "  'ofqual_learning_outcomes': [],\n",
       "  'score': 0.7575526237487793}]"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Delete all nodes from Database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "All nodes and relationships have been deleted from the database.\n"
     ]
    }
   ],
   "source": [
    "# Clear all nodes and relationships\n",
    "db.cypher_query(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "print(\"All nodes and relationships have been deleted from the database.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
