{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# docker run -p 7474:7474 -p 7687:7687 -d -e NEO4J_AUTH=neo4j/secretgraph neo4j:latest"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "## neo4j instance\n",
    "# docker run -p 7474:7474 -p 7687:7687 -d -e NEO4J_AUTH=neo4j/zavmoadmin neo4j:latest  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import os\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "ofqual_SSAs = [\n",
    "  {\n",
    "    \"Health, Public Services and Care\": [\n",
    "      \"Medicine and Dentistry\",\n",
    "      \"Nursing and subjects and vocations allied to medicine\",\n",
    "      \"Health and social care\",\n",
    "      \"Public services\",\n",
    "      \"Child development and well-being\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Science and Mathematics\": [\n",
    "      \"Science\",\n",
    "      \"Mathematics and statistics\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Agriculture, Horticulture and Animal Care\": [\n",
    "      \"Agriculture\",\n",
    "      \"Horticulture and forestry\",\n",
    "      \"Animal care and veterinary science\",\n",
    "      \"Environmental conservation\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Engineering and Manufacturing Technologies\": [\n",
    "      \"Engineering\",\n",
    "      \"Manufacturing technologies\",\n",
    "      \"Transportation operations and maintenance\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Construction, Planning and the Built Environment\": [\n",
    "      \"Architecture\",\n",
    "      \"Building and construction\",\n",
    "      \"Urban, rural and regional planning\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Digital Technology\": [\n",
    "      \"Digital technology (practitioners)\",\n",
    "      \"Digital technology (users)\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Retail and Commercial Enterprise\": [\n",
    "      \"Retailing and wholesaling\",\n",
    "      \"Warehousing and distribution\",\n",
    "      \"Service enterprises\",\n",
    "      \"Hospitality and catering\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Leisure, Travel and Tourism\": [\n",
    "      \"Sport, leisure and recreation\",\n",
    "      \"Travel and tourism\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Arts, Media and Publishing\": [\n",
    "      \"Performing arts\",\n",
    "      \"Crafts, creative arts and design\",\n",
    "      \"Media and communication\",\n",
    "      \"Publishing and information services\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"History, Philosophy and Theology\": [\n",
    "      \"History\",\n",
    "      \"Archaeology and archaeological sciences\",\n",
    "      \"Philosophy\",\n",
    "      \"Theology and religious studies\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Social Sciences\": [\n",
    "      \"Geography\",\n",
    "      \"Sociology and social policy\",\n",
    "      \"Politics\",\n",
    "      \"Economics\",\n",
    "      \"Anthropology\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Languages, Literature and Culture\": [\n",
    "      \"Languages, literature and culture of the British Isles\",\n",
    "      \"Other languages, literature and culture\",\n",
    "      \"Linguistics\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Education and Training\": [\n",
    "      \"Teaching and lecturing\",\n",
    "      \"Direct learning support\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Preparation for Life and Work\": [\n",
    "      \"Foundations for learning and life\",\n",
    "      \"Preparation for work\"\n",
    "    ]\n",
    "  },\n",
    "  {\n",
    "    \"Business, Administration and Law\": [\n",
    "      \"Accounting and finance\",\n",
    "      \"Administration\",\n",
    "      \"Business management\",\n",
    "      \"Marketing and sales\",\n",
    "      \"Law and legal services\"\n",
    "    ]\n",
    "  }\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nos_id</th>\n",
       "      <th>industry</th>\n",
       "      <th>title</th>\n",
       "      <th>overview</th>\n",
       "      <th>performance_criteria</th>\n",
       "      <th>knowledge_understanding</th>\n",
       "      <th>keywords</th>\n",
       "      <th>relevant_roles</th>\n",
       "      <th>ofqual_id</th>\n",
       "      <th>unit_id</th>\n",
       "      <th>...</th>\n",
       "      <th>qualification_type</th>\n",
       "      <th>qualification_level</th>\n",
       "      <th>assessment_methods</th>\n",
       "      <th>sector_subject_area</th>\n",
       "      <th>awarding_organisation</th>\n",
       "      <th>total_credits</th>\n",
       "      <th>guided_learning_hours</th>\n",
       "      <th>total_qualification_time</th>\n",
       "      <th>awarding_organization</th>\n",
       "      <th>similarity_score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>PPL3GEN1</td>\n",
       "      <td>Hospitality Generics</td>\n",
       "      <td>Apply and monitor food safety management proce...</td>\n",
       "      <td>This qualification allows candidates to learn ...</td>\n",
       "      <td>- Identify food safety hazards and control mea...</td>\n",
       "      <td>- Importance and types of food safety procedur...</td>\n",
       "      <td>Food safety management, kitchen management, co...</td>\n",
       "      <td>Chef, Manager, Food Safety Supervisor, Caterin...</td>\n",
       "      <td>600/6642/8</td>\n",
       "      <td>H/502/0390</td>\n",
       "      <td>...</td>\n",
       "      <td>Vocationally-Related Qualification</td>\n",
       "      <td>Level 4</td>\n",
       "      <td>Practical Demonstration/Assignment</td>\n",
       "      <td>Hospitality and catering</td>\n",
       "      <td>/organisations/RN5217</td>\n",
       "      <td>37.0</td>\n",
       "      <td>231.0</td>\n",
       "      <td>370.0</td>\n",
       "      <td>City and Guilds of London Institute</td>\n",
       "      <td>0.799143</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SKAHDBR10</td>\n",
       "      <td>Hairdressing and Barbering</td>\n",
       "      <td>Perm and neutralise hair</td>\n",
       "      <td>This qualification is aimed at individuals loo...</td>\n",
       "      <td>- Conduct a comprehensive client consultation....</td>\n",
       "      <td>- Roles and responsibilities in perming servic...</td>\n",
       "      <td>hairdressing, perming, neutralising, curling, ...</td>\n",
       "      <td>- Hairdressers\\n- Barbers\\n- Hair and Beauty T...</td>\n",
       "      <td>500/9051/3</td>\n",
       "      <td>A/001/0009</td>\n",
       "      <td>...</td>\n",
       "      <td>Vocationally-Related Qualification</td>\n",
       "      <td>Level 2</td>\n",
       "      <td>Practical Demonstration/Assignment</td>\n",
       "      <td>Service enterprises</td>\n",
       "      <td>/organisations/RN5217</td>\n",
       "      <td>54.0</td>\n",
       "      <td>470.0</td>\n",
       "      <td>540.0</td>\n",
       "      <td>City and Guilds of London Institute</td>\n",
       "      <td>0.798671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>PROMR14</td>\n",
       "      <td>Mines Rescue Operations</td>\n",
       "      <td>Establish Ventilation for Mines Rescue</td>\n",
       "      <td>This qualification is specifically designed fo...</td>\n",
       "      <td>- Select appropriate environmental measuring e...</td>\n",
       "      <td>- Key principles and terminology related to mi...</td>\n",
       "      <td>mines, mining, rescue, underground, operations...</td>\n",
       "      <td>- Coal mine operatives  \\n- Quarry workers  \\n...</td>\n",
       "      <td>610/2911/7</td>\n",
       "      <td>F/650/7598</td>\n",
       "      <td>...</td>\n",
       "      <td>Occupational Qualification</td>\n",
       "      <td>Level 4</td>\n",
       "      <td>Observation, Portfolio of Evidence, Practical ...</td>\n",
       "      <td>Manufacturing technologies</td>\n",
       "      <td>/organisations/RN5195</td>\n",
       "      <td>121.0</td>\n",
       "      <td>352.0</td>\n",
       "      <td>1176.0</td>\n",
       "      <td>MP Awards</td>\n",
       "      <td>0.795103</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>PROMR18</td>\n",
       "      <td>Mines Rescue Operations</td>\n",
       "      <td>Maintain the surface emergency base</td>\n",
       "      <td>This qualification is specifically designed fo...</td>\n",
       "      <td>- Confirm normal operation of utility services...</td>\n",
       "      <td>- Understanding the objectives and scope of mi...</td>\n",
       "      <td>mines, mining, rescue, underground, operations...</td>\n",
       "      <td>Coal mine operatives, Quarry workers and relat...</td>\n",
       "      <td>610/2911/7</td>\n",
       "      <td>F/650/7605</td>\n",
       "      <td>...</td>\n",
       "      <td>Occupational Qualification</td>\n",
       "      <td>Level 4</td>\n",
       "      <td>Observation, Portfolio of Evidence, Practical ...</td>\n",
       "      <td>Manufacturing technologies</td>\n",
       "      <td>/organisations/RN5195</td>\n",
       "      <td>121.0</td>\n",
       "      <td>352.0</td>\n",
       "      <td>1176.0</td>\n",
       "      <td>MP Awards</td>\n",
       "      <td>0.783288</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SKAH18</td>\n",
       "      <td>African Type Hair Hairdressing Standards</td>\n",
       "      <td>Provide scalp massage services</td>\n",
       "      <td>This qualification is aimed at individuals loo...</td>\n",
       "      <td>- Maintain effective and safe working methods ...</td>\n",
       "      <td>- Salon and legal operational standards  \\n- S...</td>\n",
       "      <td>scalp massage, manual techniques, mechanical t...</td>\n",
       "      <td>Hairdressers, scalp massage practitioners, and...</td>\n",
       "      <td>500/9051/3</td>\n",
       "      <td>A/001/0010</td>\n",
       "      <td>...</td>\n",
       "      <td>Vocationally-Related Qualification</td>\n",
       "      <td>Level 2</td>\n",
       "      <td>Practical Demonstration/Assignment</td>\n",
       "      <td>Service enterprises</td>\n",
       "      <td>/organisations/RN5217</td>\n",
       "      <td>54.0</td>\n",
       "      <td>470.0</td>\n",
       "      <td>540.0</td>\n",
       "      <td>City and Guilds of London Institute</td>\n",
       "      <td>0.775599</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>257</th>\n",
       "      <td>CCSJ44</td>\n",
       "      <td>Jewellery Manufacture, Silversmithing and Alli...</td>\n",
       "      <td>Form jewellery components using advanced techn...</td>\n",
       "      <td>Level 5 Diploma in Jewellery Design and Manufa...</td>\n",
       "      <td>- Plan production of jewellery components acco...</td>\n",
       "      <td>- Safety precautions for hand and machine tool...</td>\n",
       "      <td>Jewellery, design, technique, product, compone...</td>\n",
       "      <td>- Design Associate Professionals  \\n- Skilled ...</td>\n",
       "      <td>603/4592/5</td>\n",
       "      <td>M/617/5051</td>\n",
       "      <td>...</td>\n",
       "      <td>Occupational Qualification</td>\n",
       "      <td>Level 5</td>\n",
       "      <td>Portfolio of Evidence, Practical Demonstration...</td>\n",
       "      <td>Manufacturing technologies</td>\n",
       "      <td>/organisations/RN5167</td>\n",
       "      <td>108.0</td>\n",
       "      <td>612.0</td>\n",
       "      <td>1080.0</td>\n",
       "      <td>Scottish Qualifications Authority trading as SQA</td>\n",
       "      <td>0.700327</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>258</th>\n",
       "      <td>PROHSW05</td>\n",
       "      <td>Health and Safety in Wood Occupations</td>\n",
       "      <td>Manual handling safely in the workplace</td>\n",
       "      <td>This qualification supports individuals in dev...</td>\n",
       "      <td>- Move loads and objects according to safe man...</td>\n",
       "      <td>- Understand potential injuries and health iss...</td>\n",
       "      <td>handling; lifting; carrying; moving</td>\n",
       "      <td>- Carpenter  \\n- Joiner  \\n- Construction Oper...</td>\n",
       "      <td>603/2605/0</td>\n",
       "      <td>R/615/2295</td>\n",
       "      <td>...</td>\n",
       "      <td>Other Life Skills Qualification</td>\n",
       "      <td>Level 1</td>\n",
       "      <td>Portfolio of Evidence</td>\n",
       "      <td>Preparation for work</td>\n",
       "      <td>/organisations/RN5303</td>\n",
       "      <td>25.0</td>\n",
       "      <td>143.0</td>\n",
       "      <td>250.0</td>\n",
       "      <td>SFEDI Enterprises Ltd. T/A SFEDI Awards</td>\n",
       "      <td>0.700316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>259</th>\n",
       "      <td>SFHPHP42</td>\n",
       "      <td>Public Health</td>\n",
       "      <td>Enable people to improve others’ health and we...</td>\n",
       "      <td>The objective of this qualification is to prov...</td>\n",
       "      <td>- Approach and discuss roles and benefits with...</td>\n",
       "      <td>- Understanding of health perceptions and misi...</td>\n",
       "      <td>Health improvement, peer support, wellbeing, c...</td>\n",
       "      <td>Health practitioners, community health workers...</td>\n",
       "      <td>603/6806/8</td>\n",
       "      <td>T/502/7120</td>\n",
       "      <td>...</td>\n",
       "      <td>Occupational Qualification</td>\n",
       "      <td>Level 4</td>\n",
       "      <td>Coursework, Multiple Choice Examination, Portf...</td>\n",
       "      <td>Health and social care</td>\n",
       "      <td>/organisations/RN5255</td>\n",
       "      <td>NaN</td>\n",
       "      <td>215.0</td>\n",
       "      <td>370.0</td>\n",
       "      <td>Royal Society for Public Health</td>\n",
       "      <td>0.700262</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>260</th>\n",
       "      <td>IMPCB124</td>\n",
       "      <td>Craft Bakery</td>\n",
       "      <td>Design and Develop Specialist Individual Dough...</td>\n",
       "      <td>This qualification is designed for learners wh...</td>\n",
       "      <td>- Review and evaluate design needs based on cu...</td>\n",
       "      <td>- Health and safety, and food safety standards...</td>\n",
       "      <td>Dough; Design; Develop; Specialist; Products; ...</td>\n",
       "      <td>- Specialist Bakery Operations  \\n- Food Produ...</td>\n",
       "      <td>600/0514/2</td>\n",
       "      <td>M/602/4601</td>\n",
       "      <td>...</td>\n",
       "      <td>Occupational Qualification</td>\n",
       "      <td>Level 3</td>\n",
       "      <td>Portfolio of Evidence</td>\n",
       "      <td>Manufacturing technologies</td>\n",
       "      <td>/organisations/RN5184</td>\n",
       "      <td>27.0</td>\n",
       "      <td>132.0</td>\n",
       "      <td>270.0</td>\n",
       "      <td>FDQ Limited</td>\n",
       "      <td>0.700204</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>PPL2PRD1</td>\n",
       "      <td>Food Production and Cooking</td>\n",
       "      <td>Produce basic fish dishes Legacy</td>\n",
       "      <td>This vocationally related qualification has be...</td>\n",
       "      <td>- Ensure a clean and undamaged preparation are...</td>\n",
       "      <td>- Safe and hygienic working practices for fish...</td>\n",
       "      <td>basic, fish, dishes, cooking methods, food saf...</td>\n",
       "      <td>Cook, Chef, Kitchen Assistant</td>\n",
       "      <td>601/0717/0</td>\n",
       "      <td>F/601/2159</td>\n",
       "      <td>...</td>\n",
       "      <td>Vocationally-Related Qualification</td>\n",
       "      <td>Level 2</td>\n",
       "      <td>Practical Demonstration/Assignment, Practical ...</td>\n",
       "      <td>Hospitality and catering</td>\n",
       "      <td>/organisations/RN5217</td>\n",
       "      <td>66.0</td>\n",
       "      <td>438.0</td>\n",
       "      <td>660.0</td>\n",
       "      <td>City and Guilds of London Institute</td>\n",
       "      <td>0.700052</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>262 rows × 23 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        nos_id                                           industry  \\\n",
       "0     PPL3GEN1                               Hospitality Generics   \n",
       "1    SKAHDBR10                         Hairdressing and Barbering   \n",
       "2      PROMR14                            Mines Rescue Operations   \n",
       "3      PROMR18                            Mines Rescue Operations   \n",
       "4       SKAH18           African Type Hair Hairdressing Standards   \n",
       "..         ...                                                ...   \n",
       "257     CCSJ44  Jewellery Manufacture, Silversmithing and Alli...   \n",
       "258   PROHSW05              Health and Safety in Wood Occupations   \n",
       "259   SFHPHP42                                      Public Health   \n",
       "260   IMPCB124                                       Craft Bakery   \n",
       "261   PPL2PRD1                        Food Production and Cooking   \n",
       "\n",
       "                                                 title  \\\n",
       "0    Apply and monitor food safety management proce...   \n",
       "1                             Perm and neutralise hair   \n",
       "2               Establish Ventilation for Mines Rescue   \n",
       "3                  Maintain the surface emergency base   \n",
       "4                       Provide scalp massage services   \n",
       "..                                                 ...   \n",
       "257  Form jewellery components using advanced techn...   \n",
       "258            Manual handling safely in the workplace   \n",
       "259  Enable people to improve others’ health and we...   \n",
       "260  Design and Develop Specialist Individual Dough...   \n",
       "261                   Produce basic fish dishes Legacy   \n",
       "\n",
       "                                              overview  \\\n",
       "0    This qualification allows candidates to learn ...   \n",
       "1    This qualification is aimed at individuals loo...   \n",
       "2    This qualification is specifically designed fo...   \n",
       "3    This qualification is specifically designed fo...   \n",
       "4    This qualification is aimed at individuals loo...   \n",
       "..                                                 ...   \n",
       "257  Level 5 Diploma in Jewellery Design and Manufa...   \n",
       "258  This qualification supports individuals in dev...   \n",
       "259  The objective of this qualification is to prov...   \n",
       "260  This qualification is designed for learners wh...   \n",
       "261  This vocationally related qualification has be...   \n",
       "\n",
       "                                  performance_criteria  \\\n",
       "0    - Identify food safety hazards and control mea...   \n",
       "1    - Conduct a comprehensive client consultation....   \n",
       "2    - Select appropriate environmental measuring e...   \n",
       "3    - Confirm normal operation of utility services...   \n",
       "4    - Maintain effective and safe working methods ...   \n",
       "..                                                 ...   \n",
       "257  - Plan production of jewellery components acco...   \n",
       "258  - Move loads and objects according to safe man...   \n",
       "259  - Approach and discuss roles and benefits with...   \n",
       "260  - Review and evaluate design needs based on cu...   \n",
       "261  - Ensure a clean and undamaged preparation are...   \n",
       "\n",
       "                               knowledge_understanding  \\\n",
       "0    - Importance and types of food safety procedur...   \n",
       "1    - Roles and responsibilities in perming servic...   \n",
       "2    - Key principles and terminology related to mi...   \n",
       "3    - Understanding the objectives and scope of mi...   \n",
       "4    - Salon and legal operational standards  \\n- S...   \n",
       "..                                                 ...   \n",
       "257  - Safety precautions for hand and machine tool...   \n",
       "258  - Understand potential injuries and health iss...   \n",
       "259  - Understanding of health perceptions and misi...   \n",
       "260  - Health and safety, and food safety standards...   \n",
       "261  - Safe and hygienic working practices for fish...   \n",
       "\n",
       "                                              keywords  \\\n",
       "0    Food safety management, kitchen management, co...   \n",
       "1    hairdressing, perming, neutralising, curling, ...   \n",
       "2    mines, mining, rescue, underground, operations...   \n",
       "3    mines, mining, rescue, underground, operations...   \n",
       "4    scalp massage, manual techniques, mechanical t...   \n",
       "..                                                 ...   \n",
       "257  Jewellery, design, technique, product, compone...   \n",
       "258                handling; lifting; carrying; moving   \n",
       "259  Health improvement, peer support, wellbeing, c...   \n",
       "260  Dough; Design; Develop; Specialist; Products; ...   \n",
       "261  basic, fish, dishes, cooking methods, food saf...   \n",
       "\n",
       "                                        relevant_roles   ofqual_id  \\\n",
       "0    Chef, Manager, Food Safety Supervisor, Caterin...  600/6642/8   \n",
       "1    - Hairdressers\\n- Barbers\\n- Hair and Beauty T...  500/9051/3   \n",
       "2    - Coal mine operatives  \\n- Quarry workers  \\n...  610/2911/7   \n",
       "3    Coal mine operatives, Quarry workers and relat...  610/2911/7   \n",
       "4    Hairdressers, scalp massage practitioners, and...  500/9051/3   \n",
       "..                                                 ...         ...   \n",
       "257  - Design Associate Professionals  \\n- Skilled ...  603/4592/5   \n",
       "258  - Carpenter  \\n- Joiner  \\n- Construction Oper...  603/2605/0   \n",
       "259  Health practitioners, community health workers...  603/6806/8   \n",
       "260  - Specialist Bakery Operations  \\n- Food Produ...  600/0514/2   \n",
       "261                      Cook, Chef, Kitchen Assistant  601/0717/0   \n",
       "\n",
       "        unit_id  ...                  qualification_type qualification_level  \\\n",
       "0    H/502/0390  ...  Vocationally-Related Qualification             Level 4   \n",
       "1    A/001/0009  ...  Vocationally-Related Qualification             Level 2   \n",
       "2    F/650/7598  ...          Occupational Qualification             Level 4   \n",
       "3    F/650/7605  ...          Occupational Qualification             Level 4   \n",
       "4    A/001/0010  ...  Vocationally-Related Qualification             Level 2   \n",
       "..          ...  ...                                 ...                 ...   \n",
       "257  M/617/5051  ...          Occupational Qualification             Level 5   \n",
       "258  R/615/2295  ...     Other Life Skills Qualification             Level 1   \n",
       "259  T/502/7120  ...          Occupational Qualification             Level 4   \n",
       "260  M/602/4601  ...          Occupational Qualification             Level 3   \n",
       "261  F/601/2159  ...  Vocationally-Related Qualification             Level 2   \n",
       "\n",
       "                                    assessment_methods  \\\n",
       "0                   Practical Demonstration/Assignment   \n",
       "1                   Practical Demonstration/Assignment   \n",
       "2    Observation, Portfolio of Evidence, Practical ...   \n",
       "3    Observation, Portfolio of Evidence, Practical ...   \n",
       "4                   Practical Demonstration/Assignment   \n",
       "..                                                 ...   \n",
       "257  Portfolio of Evidence, Practical Demonstration...   \n",
       "258                              Portfolio of Evidence   \n",
       "259  Coursework, Multiple Choice Examination, Portf...   \n",
       "260                              Portfolio of Evidence   \n",
       "261  Practical Demonstration/Assignment, Practical ...   \n",
       "\n",
       "            sector_subject_area  awarding_organisation total_credits  \\\n",
       "0      Hospitality and catering  /organisations/RN5217          37.0   \n",
       "1           Service enterprises  /organisations/RN5217          54.0   \n",
       "2    Manufacturing technologies  /organisations/RN5195         121.0   \n",
       "3    Manufacturing technologies  /organisations/RN5195         121.0   \n",
       "4           Service enterprises  /organisations/RN5217          54.0   \n",
       "..                          ...                    ...           ...   \n",
       "257  Manufacturing technologies  /organisations/RN5167         108.0   \n",
       "258        Preparation for work  /organisations/RN5303          25.0   \n",
       "259      Health and social care  /organisations/RN5255           NaN   \n",
       "260  Manufacturing technologies  /organisations/RN5184          27.0   \n",
       "261    Hospitality and catering  /organisations/RN5217          66.0   \n",
       "\n",
       "    guided_learning_hours total_qualification_time  \\\n",
       "0                   231.0                    370.0   \n",
       "1                   470.0                    540.0   \n",
       "2                   352.0                   1176.0   \n",
       "3                   352.0                   1176.0   \n",
       "4                   470.0                    540.0   \n",
       "..                    ...                      ...   \n",
       "257                 612.0                   1080.0   \n",
       "258                 143.0                    250.0   \n",
       "259                 215.0                    370.0   \n",
       "260                 132.0                    270.0   \n",
       "261                 438.0                    660.0   \n",
       "\n",
       "                                awarding_organization  similarity_score  \n",
       "0                 City and Guilds of London Institute          0.799143  \n",
       "1                 City and Guilds of London Institute          0.798671  \n",
       "2                                           MP Awards          0.795103  \n",
       "3                                           MP Awards          0.783288  \n",
       "4                 City and Guilds of London Institute          0.775599  \n",
       "..                                                ...               ...  \n",
       "257  Scottish Qualifications Authority trading as SQA          0.700327  \n",
       "258           SFEDI Enterprises Ltd. T/A SFEDI Awards          0.700316  \n",
       "259                   Royal Society for Public Health          0.700262  \n",
       "260                                       FDQ Limited          0.700204  \n",
       "261               City and Guilds of London Institute          0.700052  \n",
       "\n",
       "[262 rows x 23 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nos_ofqual = pd.read_csv(\"/Users/mumtaz/Documents/projects/zavmo/zavmo-api/docs/rgcn/nos_ofqual_relationships.csv\")\n",
    "nos_ofqual"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "nos_ofqual.rename(columns={'sector_subject_area': 'sub_SSA'}, inplace=True)\n",
    "\n",
    "## SSA mapping to Sub SSA\n",
    "\n",
    "category_mapping = {\n",
    "    sub_category: parent_category\n",
    "        for category_dict in ofqual_SSAs \n",
    "        for parent_category, sub_categories in category_dict.items()\n",
    "        for sub_category in sub_categories\n",
    "}\n",
    "\n",
    "def assign_parent_category(sector):\n",
    "    matches = [parent for sub_cat, parent in category_mapping.items() if sub_cat in sector]\n",
    "    return matches[0] if matches else None\n",
    "\n",
    "nos_ofqual['SSA'] = (nos_ofqual['sub_SSA'].map(assign_parent_category))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of null values in SSA Column: 0\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of null values in SSA Column: {int(nos_ofqual['SSA'].isna().sum())}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique NOS IDs: 187\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of unique NOS IDs: {len(nos_ofqual['nos_id'].unique())}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.chdir(\"/Users/mumtaz/Documents/projects/zavmo/zavmo-api\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "from openai import OpenAI\n",
    "\n",
    "client = OpenAI(api_key=os.getenv(\"OPENAI_API_KEY\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def get_batch_list(texts):\n",
    "    batches = []\n",
    "    current_batch = []\n",
    "    current_batch_length = 0\n",
    "    # Set a conservative max length per batch (characters)\n",
    "    # OpenAI's text-embedding-3-small has an 8192 token limit\n",
    "    # A rough estimate is ~4 characters per token, so ~32,000 chars should be safe\n",
    "    max_batch_length = 30000\n",
    "    \n",
    "    for text in texts:\n",
    "        text_length = len(text)\n",
    "        \n",
    "        # If a single text is too long, truncate it\n",
    "        if text_length > max_batch_length:\n",
    "            text = text[:max_batch_length]\n",
    "            text_length = max_batch_length\n",
    "            \n",
    "        # If adding this text would exceed the batch limit, start a new batch\n",
    "        if current_batch_length + text_length > max_batch_length and current_batch:\n",
    "            batches.append(current_batch)\n",
    "            current_batch = []\n",
    "            current_batch_length = 0\n",
    "            \n",
    "        # Add the text to the current batch\n",
    "        current_batch.append(text)\n",
    "        current_batch_length += text_length\n",
    "        \n",
    "    # Add the last batch if it's not empty\n",
    "    if current_batch:\n",
    "        batches.append(current_batch)\n",
    "        \n",
    "    return batches\n",
    "\n",
    "def get_batch_openai_embedding(texts: list, model=\"text-embedding-3-small\", **kwargs):\n",
    "    \"\"\"\n",
    "    Get embeddings of a batch of texts from OpenAI API.\n",
    "\n",
    "    Args:\n",
    "        texts (list): List of texts to get embeddings for.\n",
    "        model (str): Model to use for embeddings.\n",
    "        **kwargs: Additional arguments to pass to the OpenAI API.\n",
    "    Returns:\n",
    "        list[list]: List of embeddings of the texts.\n",
    "    \"\"\"\n",
    "    text_batches = get_batch_list(texts)\n",
    "    print(f\"total batches: {len(text_batches)}\")\n",
    "    embeddings = []\n",
    "    for text_batch in text_batches:\n",
    "        response = client.embeddings.create(\n",
    "            model=model,\n",
    "            input=text_batch,\n",
    "            **kwargs,\n",
    "        )\n",
    "        embeddings += [r.embedding for r in response.data]\n",
    "    return embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "## zavmo neo4j instance\n",
    "uri = \"neo4j://51.20.45.38:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"zavmoadmin\"\n",
    "\n",
    "## local neo4j instance\n",
    "uri = \"neo4j://localhost:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"secretgraph\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection established.\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "    driver.verify_connectivity()\n",
    "    print(\"Connection established.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import StructuredNode, StringProperty, RelationshipTo, config, db, ArrayProperty, FloatProperty\n",
    "\n",
    "# Configure the connection to Neo4j\n",
    "config.DATABASE_URL = \"bolt://neo4j:secretgraph@localhost:7687\"\n",
    "\n",
    "class SSA(StructuredNode):\n",
    "    name = StringProperty(unique=True)\n",
    "    sub_ssas = RelationshipTo('SubSSA', 'HAS_SUB_SSA')\n",
    "\n",
    "class SubSSA(StructuredNode):\n",
    "    name = StringProperty(unique=True)\n",
    "    ssa = RelationshipTo(SSA, 'BELONGS_TO')\n",
    "    nos_documents = RelationshipTo('NOS', 'HAS_NOS')\n",
    "    ofqual_documents = RelationshipTo('OFQUAL', 'HAS_OFQUAL')\n",
    "\n",
    "class OFQUAL(StructuredNode):\n",
    "    ofqual_id = StringProperty(unique=True, required=True, primary_key=True)\n",
    "    unit_id = StringProperty(unique=True) \n",
    "    title = StringProperty(unique=True)\n",
    "    overview = StringProperty()\n",
    "    description = StringProperty()\n",
    "    learning_outcomes = StringProperty()\n",
    "    embedding = ArrayProperty(base_property=FloatProperty())\n",
    "    \n",
    "    sub_ssa = RelationshipTo(SubSSA, 'BELONGS_TO')\n",
    "    ssa = RelationshipTo(SSA, 'BELONGS_TO')\n",
    "\n",
    "class NOS(StructuredNode):\n",
    "    nos_id = StringProperty(unique=True, required=True, primary_key=True)\n",
    "    title = StringProperty()\n",
    "    overview = StringProperty()\n",
    "    performance_criteria = StringProperty()\n",
    "    knowledge_criteria = StringProperty()\n",
    "    nos_industry = StringProperty()\n",
    "    keywords = StringProperty()\n",
    "    relevant_roles = StringProperty()\n",
    "    embedding = ArrayProperty(base_property=FloatProperty())\n",
    "    \n",
    "    sub_ssa = RelationshipTo(SubSSA, 'BELONGS_TO')\n",
    "    ssa = RelationshipTo(SSA, 'BELONGS_TO')\n",
    "\n",
    "    ofquals = RelationshipTo(\"OFQUAL\", \"RELATED_TO\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SSA and Sub_SSA - Nodes Creation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "SubSSAs = [(key, value) for key, value in category_mapping.items()]\n",
    "SSAs    = [list(ofqual_SSA.keys())[0] for ofqual_SSA in ofqual_SSAs]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(15, 50)"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(SSAs), len(SubSSAs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "ssa_nodes = {}\n",
    "for name in SSAs:\n",
    "    ssa = SSA(name=name).save()\n",
    "    ssa_nodes[name] = ssa"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SSA and SubSSA nodes created successfully!\n"
     ]
    }
   ],
   "source": [
    "# Creating SubSSA nodes and linking them to SSA\n",
    "sub_ssa_nodes = {}\n",
    "for sub_ssa_name, ssa_name in SubSSAs:\n",
    "    sub_ssa = SubSSA(name=sub_ssa_name).save()\n",
    "    sub_ssa.ssa.connect(ssa_nodes[ssa_name])\n",
    "    sub_ssa_nodes[sub_ssa_name] = sub_ssa\n",
    "\n",
    "print(\"SSA and SubSSA nodes created successfully!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import db\n",
    "\n",
    "class VectorIndex:\n",
    "    def __init__(self, node:str, index_name=\"test_embedding_index\", dimension=1536, similarity_function=\"cosine\"):\n",
    "        self.index_name = index_name\n",
    "        self.dimension = dimension\n",
    "        self.similarity_function = similarity_function\n",
    "        self.node = node\n",
    "    \n",
    "    def index_exists(self):\n",
    "        \"\"\"Checks if the vector index exists.\"\"\"\n",
    "        query = \"\"\"\n",
    "        SHOW INDEXES\n",
    "        \"\"\"\n",
    "        results, _ = db.cypher_query(query)\n",
    "        \n",
    "        # Extract the index names from the results\n",
    "        index_names = [row[0] for row in results]  # Adjust this based on Neo4j version\n",
    "        return self.index_name in index_names\n",
    "\n",
    "    def list_vector_indexes(self):\n",
    "        \"\"\"Lists all vector indexes.\"\"\"\n",
    "        query = \"\"\"\n",
    "        SHOW INDEXES\n",
    "        \"\"\"\n",
    "        results, _ = db.cypher_query(query)\n",
    "        return results\n",
    "\n",
    "    def create_vector_index(self):\n",
    "        \"\"\"Creates a vector index if it does not exist.\"\"\"\n",
    "\n",
    "        query = f\"\"\"\n",
    "        CREATE VECTOR INDEX {self.index_name} \n",
    "        FOR (n:{self.node}) \n",
    "        ON (n.embedding) \n",
    "        OPTIONS {{indexConfig: {{`vector.dimensions`: {self.dimension}, `vector.similarity_function`: \"{self.similarity_function}\"}}}};\n",
    "        \"\"\"\n",
    "        try:\n",
    "            db.cypher_query(query)\n",
    "            print(f\"Vector index '{self.index_name}' created successfully.\")\n",
    "        except Exception as e:\n",
    "            print(f\"\")\n",
    "\n",
    "    def delete_vector_index(self):\n",
    "        \"\"\"Deletes the vector index if it exists.\"\"\"\n",
    "        query = f\"DROP INDEX {self.index_name};\"\n",
    "        try:\n",
    "            db.cypher_query(query)\n",
    "            print(f\"Vector index '{self.index_name}' deleted successfully.\")\n",
    "        except Exception as e:\n",
    "            print(f\"Error deleting vector index: {e}\")\n",
    "    \n",
    "    def retrieve_nos(self, query_embedding, top_k=5):\n",
    "        query = f\"\"\"\n",
    "            CALL db.index.vector.queryNodes('{self.index_name}', $top_k, $query_embedding) \n",
    "            YIELD node, score\n",
    "            OPTIONAL MATCH (node)-[:BELONGS_TO]->(ssa:SSA)\n",
    "            OPTIONAL MATCH (node)-[:BELONGS_TO]->(subssa:SubSSA)\n",
    "            OPTIONAL MATCH (node)-[:RELATED_TO]->(ofqual:OFQUAL)\n",
    "            RETURN \n",
    "                node.nos_id AS nos_id, \n",
    "                node.title AS title, \n",
    "                COLLECT(ofqual.ofqual_id) AS ofqual_ids, \n",
    "                COLLECT(ofqual.unit_id) AS ofqual_units,\n",
    "                COLLECT(ofqual.learning_outcomes) AS ofqual_learning_outcomes,\n",
    "                score\n",
    "            ORDER BY score DESC\n",
    "        \"\"\"\n",
    "\n",
    "        result, columns = db.cypher_query(query, {\"query_embedding\": query_embedding, \"top_k\": top_k})\n",
    "        \n",
    "        formatted_result = [dict(zip(columns, row)) for row in result]\n",
    "        \n",
    "        return formatted_result\n",
    "\n",
    "    def drop_all_vector_records(self,):\n",
    "        \"\"\"\n",
    "        Deletes all records of a given Neomodel class from the Neo4j database.\n",
    "        \"\"\"\n",
    "        query = f\"MATCH (n:{self.node}) DETACH DELETE n\"\n",
    "        db.cypher_query(query)\n",
    "        print(f\"All records from '{self.node}' have been deleted, but the index remains intact.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## NOS Nodes Creation, Database Ingestion, Vector Index Creation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "nos_ids = nos_ofqual['nos_id'].unique()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def ingest_nos_to_db_with_ofqual(nos_data):\n",
    "    with db.transaction:# Get SSA & SubSSA nodes\n",
    "        ssa_node = SSA.nodes.get(name=nos[\"SSA\"])\n",
    "        sub_ssa_node = SubSSA.nodes.get(name=nos[\"sub_SSA\"])\n",
    "        if not ssa_node or not sub_ssa_node:\n",
    "            continue\n",
    "        \n",
    "        nos_node = NOS(\n",
    "                nos_id=nos[\"nos_id\"],\n",
    "                title=nos[\"title\"],\n",
    "                overview=nos[\"overview\"],\n",
    "                performance_criteria=nos[\"performance_criteria\"],\n",
    "                knowledge_criteria=nos[\"knowledge_understanding\"],\n",
    "                nos_industry=nos[\"industry\"],\n",
    "                keywords=nos[\"keywords\"],\n",
    "                relevant_roles=nos[\"relevant_roles\"],\n",
    "                embedding=nos[\"embedding\"]\n",
    "            ).save()\n",
    "        for _, nos in nos_data.iterrows():\n",
    "            ofqual_node = OFQUAL(\n",
    "                ofqual_id=nos[\"ofqual_id\"],\n",
    "                unit_id=nos[\"unit_id\"],\n",
    "                title=nos[\"title\"],\n",
    "                overview=nos[\"overview\"],\n",
    "                description=nos[\"description\"],\n",
    "            learning_outcomes=nos[\"learning_outcomes\"]).save()\n",
    "        \n",
    "        nos_node.ssa.connect(ssa_node)\n",
    "        nos_node.sub_ssa.connect(sub_ssa_node)\n",
    "        nos_node.ofquals.connect(ofqual_node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for nos_id in nos_ids:\n",
    "    current_nos_data = nos_ofqual[nos_ofqual['nos_id'] == nos_id]\n",
    "    ingest_nos_to_db_with_ofqual(current_nos_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['nos_id', 'industry', 'title', 'overview', 'performance_criteria',\n",
       "       'knowledge_understanding', 'keywords', 'relevant_roles', 'ofqual_id',\n",
       "       'unit_id', 'unit_title', 'unit_description', 'unit_learning_outcomes',\n",
       "       'qualification_type', 'qualification_level', 'assessment_methods',\n",
       "       'sub_SSA', 'awarding_organisation', 'total_credits',\n",
       "       'guided_learning_hours', 'total_qualification_time',\n",
       "       'awarding_organization', 'similarity_score', 'SSA'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nos_ofqual.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "def store_nos_with_ofqual():\n",
    "    nos_list = sample_nos.to_dict(orient=\"records\")\n",
    "\n",
    "    nos_texts_for_embeddings = [f\"Sector Subject Area: {nos['SSA']}\\n\\nSub Sector Subject Area: {nos['sub_SSA']}\\n\\nIndustry: {nos['industry']}\\n\\nTitle: {nos['title']}\\n\\nOverview:{nos['overview']}\"\n",
    "                                for nos in nos_list]\n",
    "    \n",
    "    embeddings = get_batch_openai_embedding(nos_texts_for_embeddings)\n",
    "    sample_nos['embedding'] = embeddings\n",
    "    ingest_nos_to_db_with_ofqual(sample_nos.to_dict(orient=\"records\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(6, 10)"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample_nos.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Vector index 'nos_embedding_index' created successfully.\n",
      "total batches: 1\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: RELATED_TO)} {position: line: 1, column: 66, offset: 65} for query: 'MATCH (nos) WHERE elementId(nos)=$nos_1 WITH nos MATCH (nos)-[r1:`RELATED_TO`]->(ofquals_r1:OFQUAL) WHERE elementId(ofquals_r1) = $ofquals_r1_contains_1 WITH ofquals_r1 RETURN count(ofquals_r1)'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embeddings present for NOS: INSML017 and found 4 candidates\n",
      "Embeddings present for NOS: INSML021 and found 4 candidates\n",
      "No ofqual candidates found for NOS: PROMPR4\n",
      "Embeddings present for NOS: SFJCCBE2.1 and found 4 candidates\n",
      "Embeddings present for NOS: SFJCCBE4.1 and found 4 candidates\n",
      "No ofqual candidates found for NOS: SFJHD2\n"
     ]
    }
   ],
   "source": [
    "nos_index = VectorIndex(\"NOS\", index_name=\"nos_embedding_index\")\n",
    "# nos_index.delete_vector_index()\n",
    "nos_index.create_vector_index()\n",
    "# # nos_index.index_exists()\n",
    "store_nos_with_ofqual()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[6]], ['indexed_documents'])"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\"MATCH (n:NOS) WHERE n.embedding IS NOT NULL RETURN COUNT(n) AS indexed_documents;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "All records from 'NOS' have been deleted, but the index remains intact.\n"
     ]
    }
   ],
   "source": [
    "# nos_index.drop_all_vector_records()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Querying"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "total batches: 1\n"
     ]
    }
   ],
   "source": [
    "query_text = \"\"\"Sector Subject Area: Business, Administration and Law\n",
    "Sub Sector Subject Area: Business management\n",
    "\n",
    "The People Partner works within the People Partnering team to support the delivery of the overarching people plan of the Business Unit and Centrica people strategy.\n",
    "The People Partner works at pace to diagnose, design and deliver the best People solutions required for delivering the people plan, linking in with People Consultants, Centres of Excellence and other HR shared services to leverage key expertise / ensure consistent delivery.\n",
    "Working as part of a flexible people partnering team ensuring business intimacy & commerciality to provide business support where needed. Providing professional end to end HR expertise, coaching & support to business leaders.\"\"\"\n",
    "query_embedding = get_batch_openai_embedding([query_text])[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.AggregationSkippedNull} {category: UNRECOGNIZED} {title: The query contains an aggregation function that skips null values.} {description: null value eliminated in set function.} {position: None} for query: \"\\n            CALL db.index.vector.queryNodes('nos_embedding_index', $top_k, $query_embedding) \\n            YIELD node, score\\n            OPTIONAL MATCH (node)-[:BELONGS_TO]->(ssa:SSA)\\n            OPTIONAL MATCH (node)-[:BELONGS_TO]->(subssa:SubSSA)\\n            OPTIONAL MATCH (node)-[:RELATED_TO]->(ofqual:OFQUAL)\\n            RETURN \\n                node.nos_id AS nos_id, \\n                node.title AS title, \\n                COLLECT(ofqual.ofqual_id) AS ofqual_ids, \\n                COLLECT(ofqual.unit_id) AS ofqual_units,\\n                COLLECT(ofqual.learning_outcomes) AS ofqual_learning_outcomes,\\n                score\\n            ORDER BY score DESC\\n        \"\n"
     ]
    }
   ],
   "source": [
    "nos_index = VectorIndex(\"NOS\", index_name=\"nos_embedding_index\")\n",
    "results = nos_index.retrieve_nos(query_embedding, top_k=10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Delete all nodes from Database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "All nodes and relationships have been deleted from the database.\n"
     ]
    }
   ],
   "source": [
    "# Clear all nodes and relationships\n",
    "db.cypher_query(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "print(\"All nodes and relationships have been deleted from the database.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
