[
  {
    "competency": "Use sales-related information for planning and implementing sales activities",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "List the steps involved in using sales-related information for planning."
      },
      {
        "level": "Understand",
        "criteria": "Explain how sales information impacts decision-making in planning sales activities."
      },
      {
        "level": "Apply",
        "criteria": "Create a sales plan using sales-related information for a hypothetical product."
      },
      {
        "level": "Analyze",
        "criteria": "Evaluate the effectiveness of a sales plan based on provided sales data."
      },
      {
        "level": "Evaluate",
        "criteria": "Assess the outcomes of a sales activity against planning objectives."
      },
      {
        "level": "Create",
        "criteria": "Design a comprehensive sales planning process based on current sales data."
      }
    ]
  },
  {
    "competency": "Store information on the sales technology systems, checking its quality, validity and reliability",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Identify the key elements necessary to ensure data quality in sales systems."
      },
      {
        "level": "Understand",
        "criteria": "Describe the implications of storing unreliable data in sales technology systems."
      },
      {
        "level": "Apply",
        "criteria": "Implement a data validation process in a sales technology system."
      },
      {
        "level": "Analyze",
        "criteria": "Break down the factors that contribute to data reliability in sales systems."
      },
      {
        "level": "Evaluate",
        "criteria": "Appraise the quality of information stored in a given sales technology case."
      },
      {
        "level": "Create",
        "criteria": "Develop a framework for assessing the quality and validity of data in sales systems."
      }
    ]
  },
  {
    "competency": "Maintain the sales-related information stored in the technology systems, ensuring it is accurate and up to date",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Recall the standards for maintaining accurate sales information."
      },
      {
        "level": "Understand",
        "criteria": "Clarify the process for updating information in sales technology systems."
      },
      {
        "level": "Apply",
        "criteria": "Demonstrate updating and maintaining sales information in a provided technology system scenario."
      },
      {
        "level": "Analyze",
        "criteria": "Examine discrepancies in sales records and identify maintenance needs."
      },
      {
        "level": "Evaluate",
        "criteria": "Judge the effectiveness of the current procedures for maintaining sales-related information."
      },
      {
        "level": "Create",
        "criteria": "Formulate a guideline document for maintaining accurate sales information."
      }
    ]
  },
  {
    "competency": "Use tools and technology systems for automation of sales-related tasks and activities",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "List different tools available for automating sales tasks."
      },
      {
        "level": "Understand",
        "criteria": "Explain the advantages of automation in sales-related activities."
      },
      {
        "level": "Apply",
        "criteria": "Utilize an automation tool to perform a sales-related task."
      },
      {
        "level": "Analyze",
        "criteria": "Compare automated processes versus manual processes in sales activities."
      },
      {
        "level": "Evaluate",
        "criteria": "Assess the impact of automation on sales team productivity."
      },
      {
        "level": "Create",
        "criteria": "Design an automated workflow for a specific sales task."
      }
    ]
  },
  {
    "competency": "Share sales-related information for collaboration with members of the sales team",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Enumerate methods for sharing sales information with team members."
      },
      {
        "level": "Understand",
        "criteria": "Discuss the importance of collaboration in sales activities."
      },
      {
        "level": "Apply",
        "criteria": "Collaborate with a team by sharing feedback on sales prospects using a shared platform."
      },
      {
        "level": "Analyze",
        "criteria": "Identify barriers to effective information sharing in a sales team."
      },
      {
        "level": "Evaluate",
        "criteria": "Critique a case study on collaboration within a sales team."
      },
      {
        "level": "Create",
        "criteria": "Craft a collaborative communication strategy for a sales team."
      }
    ]
  },
  {
    "competency": "Use lead generation automation technology to qualify the leads",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Identify the key features of lead generation automation technology."
      },
      {
        "level": "Understand",
        "criteria": "Explain how automation improves the qualification process of leads."
      },
      {
        "level": "Apply",
        "criteria": "Use a lead generation tool to qualify a list of potential leads."
      },
      {
        "level": "Analyze",
        "criteria": "Assess the quality of qualified leads generated through automation."
      },
      {
        "level": "Evaluate",
        "criteria": "Evaluate the effectiveness of different lead generation methods."
      },
      {
        "level": "Create",
        "criteria": "Develop a new strategy for lead qualification using automation tools."
      }
    ]
  },
  {
    "competency": "Collate potential leads and prioritise these in accordance with sales targets",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "State the criteria for prioritizing leads according to sales targets."
      },
      {
        "level": "Understand",
        "criteria": "Interpret sales targets and their implications for lead prioritization."
      },
      {
        "level": "Apply",
        "criteria": "Prioritize a given list of leads based on specified sales targets."
      },
      {
        "level": "Analyze",
        "criteria": "Analyze the given sales data to identify high-priority leads."
      },
      {
        "level": "Evaluate",
        "criteria": "Review the effectiveness of a lead prioritization strategy."
      },
      {
        "level": "Create",
        "criteria": "Design a lead prioritization framework based on sales objectives."
      }
    ]
  },
  {
    "competency": "Summarise information appropriately from sales systems for reporting to management",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Recall the main components required in a sales report."
      },
      {
        "level": "Understand",
        "criteria": "Discuss the importance of clear reporting to management."
      },
      {
        "level": "Apply",
        "criteria": "Generate a report from sales data using a provided template."
      },
      {
        "level": "Analyze",
        "criteria": "Break down sales data to identify key insights for reports."
      },
      {
        "level": "Evaluate",
        "criteria": "Assess the clarity and effectiveness of a sales report."
      },
      {
        "level": "Create",
        "criteria": "Develop a comprehensive reporting template for sales data."
      }
    ]
  },
  {
    "competency": "Follow up incoming leads and assign the ownership of quality leads to the most relevant members of the sales team",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "List the steps involved in lead follow-up processes."
      },
      {
        "level": "Understand",
        "criteria": "Explain the rationale behind assigning leads to specific team members."
      },
      {
        "level": "Apply",
        "criteria": "Execute a follow-up process for incoming leads using a CRM system."
      },
      {
        "level": "Analyze",
        "criteria": "Differentiate between high-quality and low-quality leads and their implications for ownership assignment."
      },
      {
        "level": "Evaluate",
        "criteria": "Examine a case where lead follow-up and assignment affected sales outcomes."
      },
      {
        "level": "Create",
        "criteria": "Formulate a policy for lead assignment and follow-up in a sales team."
      }
    ]
  },
  {
    "competency": "Monitor, process or delegate daily tasks within assigned ownership and visibility on technology systems",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Identify daily tasks typically monitored within a sales team."
      },
      {
        "level": "Understand",
        "criteria": "Explain the role of visibility in task delegation."
      },
      {
        "level": "Apply",
        "criteria": "Demonstrate monitoring daily tasks in a given sales technology system."
      },
      {
        "level": "Analyze",
        "criteria": "Evaluate the effectiveness of current monitoring practices for task management."
      },
      {
        "level": "Evaluate",
        "criteria": "Assess how effective delegation impacts team productivity."
      },
      {
        "level": "Create",
        "criteria": "Design a task monitoring and delegation strategy for sales activities."
      }
    ]
  },
  {
    "competency": "Monitor own use of the sales technology system, seeking guidance, support and skills development where necessary",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Recall the importance of self-monitoring in technology system usage."
      },
      {
        "level": "Understand",
        "criteria": "Identify how seeking guidance contributes to skill development."
      },
      {
        "level": "Apply",
        "criteria": "Reflect on personal experiences to identify areas for improvement in using sales technology."
      },
      {
        "level": "Analyze",
        "criteria": "Assess the effectiveness of personal monitoring strategies in using the sales technology system."
      },
      {
        "level": "Evaluate",
        "criteria": "Critique personal usage of sales technology systems based on performance outcomes."
      },
      {
        "level": "Create",
        "criteria": "Develop a personal development plan for improving skills in using sales technology."
      }
    ]
  },
  {
    "competency": "Provide feedback on the sales technology systems, your pipeline management and other tasks and activities",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "List the types of feedback typically provided on sales systems."
      },
      {
        "level": "Understand",
        "criteria": "Explain the role of feedback in improving sales technology systems."
      },
      {
        "level": "Apply",
        "criteria": "Provide constructive feedback based on a scenario involving the sales system."
      },
      {
        "level": "Analyze",
        "criteria": "Examine the feedback mechanisms in place for sales technology systems."
      },
      {
        "level": "Evaluate",
        "criteria": "Assess the impact of feedback on the improvement of sales processes."
      },
      {
        "level": "Create",
        "criteria": "Propose a feedback system for enhancing sales technology effectiveness."
      }
    ]
  },
  {
    "competency": "Seek evidence-based recommendations for improvement of sales activities and personal productivity using the technology systems",
    "blooms_taxonomy_criteria": [
      {
        "level": "Remember",
        "criteria": "Recall a method for gathering evidence-based data."
      },
      {
        "level": "Understand",
        "criteria": "Describe how recommendations can enhance sales processes."
      },
      {
        "level": "Apply",
        "criteria": "Use data to formulate recommendations for improving sales activities."
      },
      {
        "level": "Analyze",
        "criteria": "Identify trends in sales data that can suggest areas for improvement."
      },
      {
        "level": "Evaluate",
        "criteria": "Assess the feasibility of implementing a given recommendation for improvement."
      },
      {
        "level": "Create",
        "criteria": "Develop an innovative approach for enhancing personal productivity using technology."
      }
    ]
  }
]